var past = [];
function getItem(){
    if (past.length == hebrew.length) {
        past = [];
    }
    while (true) {
        var i = Math.floor(Math.random() * hebrew.length);
        var found = false;
        for (j = 0; j < past.length; j++) {
            if (i == past[j]) {
                found = true;
                break;
            }
        }
        if (!found) {
            break
        }
    }
    past.push(i);
    document.getElementById("hebrewText").innerHTML = hebrew[i];
	document.getElementById("arabicText").innerHTML = arabic[i];
}

var hebrew = [
"אייל גולן",
"ריהאנה",
"פיירוז",
"הארי פוטר",
"דונלד טראמפ",
"כריסטיאנו רונאלדו",
"מוחמד עלי",
"גל גדות",
"מארק צוקרברג",
"ישו",
"ג׳סטין ביבר",
"אלברט איינשטיין",
"ברק אובמה",
"אנג׳לינה ג׳ולי",
"וולפגנג אמדיאוס מוצארט",
"אלביס פרסלי",
"ג׳יימס בונד",
"קים קרדשיאן",
"המונה ליזה",
"אמינם",
"טום קרוז",
"ויליאם שייקספיר",
"שרלוק הולמס",
"בוב ספוג"
];

var arabic = [
"ايال غولان",
" ريانا",
"فيروز",
"هاري بوتر",
"دونالد ترامب",
"كريستيانو رونالدو",
"محمد علي",
"غال غادوت",   
"مارك زوكربيرغ", 
"عيسى بن مريم", 
"جاستن بيبر",
"ألبرت أينشتاين",
"باراك أوباما",
"أنجلينا جولي",
"فولفغانغ أماديوس موزارت",
"إلفيس بريسلي",
"جيمس بوند",
"كيم كردشيان",
"موناليزا",
"إمينيم",
"توم كروز",
"وليم شكسبير",
"شرلوك هولمز",
"سبونج بوب"
];