var i = -1
function getItem(){
	i = i + 1;
	if (i == dataJson.length) {
		i = 0;
	}
	document.getElementById("button-and-text").innerHTML = `<a class="btn btn-success btn-xl rtl" onclick="getItem()" role="button">
 <span class="my-activity-button-text">
		  המשיכו - كملو!
		  </span>
		  <span class="glyphicon glyphicon glyphicon glyphicon-play my-activity-button"></span>
        </a>`;
	document.getElementById("my-text-box").innerHTML = `<div class="rectangle">
                <h3 class="rtl" id="hebrewText"></h3>
		<h3 class="rtl" id="arabicText"></h3>
        <h3 class="rtl" id="taatikText"></h3>
            </div>`;	
    document.getElementById("hebrewText").innerHTML = data[i].Hebrew;
	document.getElementById("arabicText").innerHTML = data[i].Arabic;
	document.getElementById("taatikText").innerHTML = data[i].Taatik;
}

const dataJson = [
  {
    "Hebrew": "בתקופה האחרונה רכיבה על אופניים חשמליות הפכה לפופולרית במיוחד עבור צעירים רבים. יש אנשים שטוענים שכלי זה הוא טוב לסביבה ותורם לעצמאיות וניידות גם עבור בני נוער. לעומת זאת יש אנשים שחושבים שמדובר בכלי מסוכן שגורם לתאונות רבות ובני נוער הם צעירים מדי בשביל להשתמש בו. הסבר לקבוצה למה הצד שקיבלת הוא הצודק.",
    "Arabic": "بالفترة الاخيرة فيه انتشار واسع عند الشباب لاستعمال ع الدراجات الكهربائية. فيه ناس اللي بيدّعو انه هاي الوسيلة غير مضرة للبيئة وبتساعد على استقلالية وتناقل الشباب. من جهة تانية، فيه ناس اللي بيشوفوها كوسيلة خطير الوسيلة اللي بتسبب حوادث كثيرة وانه الشباب مش واعيين كفاية لاستعاملها. اشرح لمجموعتك ليش الموقف اللي احذته  هو الصادق.",
    "Taatik": "באלפתרה אלאח'ירה פיה אנתשאר ואסע ענד אלשבאב לאסתעמאל ע אלדראג'את אלכהרבאאיה. פיה נאס אללי בידעו אנה האי אלוסילה ע'יר מצ'רה ללביאה ובתסאעד עלא אסתקלאליה ותנאקל אלשבאב. מן ג'הה תאניה, פיה נאס אללי בישופוהא כוסילה ח'טיר אלוסילה אללי בתסבב חואדת' כת'ירה ואנה אלשבאב מש ואעיין כפאיה לאסתעאמלהא. אשרח למג'מועתכ ליש אלמוקף אללי אחד'תה  הו אלצאדק."
  },
  {
    "Hebrew": "היום הבחינה הפסיכומטרית היא תנאי לקבלה לאוניברסיטה, ומה שהסטודנט יוכל ללמוד ייקבע לפי הציון שיקבל במבחן. יש תלמידים שחושבים שצריך לשנות או להחליף את הבחינה בשיטה אחרת כי לא רואים בה מדד מתאים והוגן לקבלה ללימודים. מצד שני, יש אחרים שטוענים שזו הדרך הכי טובה לסנן את המועמדים הכי טובים עבור כל תואר. הסבר לקבוצה למה הצד שקיבלת הוא הצודק.",
    "Arabic": "اليوم امتحان البسيخومتري هو شرط اساسي للقبول لجامعة، وعلامة الطالب في الامتحان بتقرر شو بيقدر يتعلم. فيه طلاب اللي بيقولو انه لازم يغيرو او يبدلو الامتحان بطريقة  تانية  لانهم ما بيشوفو فيه مقياس مناسب وعادل للقبول لتعليم. من جهة تانية فيه اللي بيدّعو انه هاي احسن الطريقة لتصفيات المتقدمين لكل لقب. اشرح لمجموعتك ليش الموقف اللي احذته هو الصادق.",
    "Taatik": "אליום אמתחאן אלבסיח'ומתרי הו שרט אסאסי ללקבול לג'אמעה, ועלאמה אלטאלב פי אלאמתחאן בתקרר שו ביקדר יתעלם. פיה טלאב אללי ביקולו אנה לאזם יע'ירו או יבדלו אלאמתחאן בטריקה  תאניה  לאנהם מא בישופו פיה מקיאס מנאסב ועאדל ללקבול לתעלים. מן ג'הה תאניה פיה אללי בידעו אנה האי אחסן אלטריקה לתצפיאת אלמתקדמין לכל לקב. אשרח למג'מועתכ ליש אלמוקף אללי אחד'תה הו אלצאדק."
  },
  {
    "Hebrew": "בשנים האחרונות על מנת לקבל תעודת בגרות חייב כל תלמיד לבצע שעות התנדבות בקהילה. יש שחושבים שזו דרך טובה על מנת לעודד את התלמידים להתנדב ולתרום לחברה גם בעתיד. לעומת זאת יש שטוענים שהעובדה שמכריחים את התלמידים לעשות זאת רק תגרום להם לרגשות שליליות ולא תשיג את המטרה. הסבר לקבוצה למה הצד שקיבלת הוא הצודק.",
    "Arabic": "في السنين الاخيرة عشان يحصل التلميد عشهادة بجروت هو مجبور يطوع. في الي بفكروا انها طريقة منيحة لتشجيع الطلاب على التطوع والمساهمه للمجتمع في المستقبل.لكن في الي بدعوا انه اجبار الطلاب عالتطوع.  بس بتخليهم يحسوا بطريقة سلبية. اشرح الجانب الي اخذتة للمجموعة.",
    "Taatik": "פי אלסנין אלאח'ירה עשאן יחצל אלתלמיד עשהאדה בג'רות הו מג'בור יטוע. פי אלי בפכרוא אנהא טריקה מניחה לתשג'יע אלטלאב עלא אלתטוע ואלמסאהמה ללמג'תמע פי אלמסתקבל.לכן פי אלי בדעוא אנה אג'באר אלטלאב עאלתטוע.  בס בתח'ליהם יחסוא בטריקה סלביה. אשרח אלג'אנב אלי אח'ד'תה ללמג'מועה."
  },
  {
    "Hebrew": "כיום בני נוער רבים הולכים לעבוד על מנת לחסוך כסף ולהתפתח מבחינה אישית. יש אנשים שטוענים שעדיף שבני הנוער היו מתרכזים בלימודים ולא היו יוצאים לעבוד, גם מכיוון שמעסיקים רבים מנצלים אותם ומספקים להם תנאים לא מספיק טובים. מצד שני יש שחושבים שדבר זה תורם לעצמאות ולחוש האחריות של הצעירים ועוזר להתפתחותם. הסבר לקבוצה למה הצד שקיבלת הוא הצודק.",
    "Arabic": "اليوم كثير شباب صغار بروحوا يشتغلوا عشان يوفروا مصاري ويتقدموا ، في ناس بتقول انه احسن انهم يركزوا في التعليم وما يشتغلوا، برضه لانه كثير مشغلين بستغلوهم.من جهة ثانية في الي بفكروا انه هاذ الاشي بساهم في استقلاليتهم ،وانهم يحسوا في المسؤولية. اشرح الجانب الي اخذتة للمجموعة.",
    "Taatik": "אליום כת'יר שבאב צע'אר ברוחוא ישתע'לוא עשאן יופרוא מצארי ויתקדמוא , פי נאס בתקול אנה אחסן אנהם ירכזוא פי אלתעלים ומא ישתע'לוא, ברצ'ה לאנה כת'יר משע'לין בסתע'לוהם.מן ג'הה ת'אניה פי אלי בפכרוא אנה האד' אלאשי בסאהם פי אסתקלאליתהם, ואנהם יחסוא פי אלמסאוליה. אשרח אלג'אנב אלי אח'ד'תה ללמג'מועה."
  },
  {
    "Hebrew": "כיום, כמעט לכל תלמיד יש טלפון נייד חכם. בחלק מבתי הספר אוסרים על התלמידים להביא אותם איתם, מכיוון שזה יכול להפריע לריכוז שלהם בשיעור וללמידה, וגם מכיוון שהם יכולים להשתמש בו למטרות שליליות. מצד שני, תלמידים מרגישים שזוהי פגיעה בזכויות הפרט שלהם, ובנוסף מרגישים ביטחון בזכות הטלפון מכיוון שכך הם יכולים ליצור בקלות קשר עם הוריהם במקרה חירום. הסבר לקבוצה למה הצד שקיבלת הוא הצודק.",
    "Arabic": "اليوم تقريبًا لكل طالب في جهاز ذكي(بلفون)،في مدارس بتمنع الطلاب يجيبوها عالمدرسة، لانه هاذ ممكن يأثر عتركيزهم في التعليم، وبرضه لانهم ممكن يستعملوه لاهداف سلبية. من جهة ثانية الطلاب بدعوا انه هاد القرار بمس بخصوصيتهم اضافة على ذلك حيازة الجهاز بتحسسهم بالامان، لانهم بقدروا بسهولة يتصلوا لإهلهم.",
    "Taatik": "אליום תקריבא לכל טאלב פי ג'האז ד'כי(בלפונ),פי מדארס בתמנע אלטלאב יג'יבוהא עאלמדרסה, לאנה האד' ממכן יאת'ר עתרכיזהם פי אלתעלים, וברצ'ה לאנהם ממכן יסתעמלוה לאהדאף סלביה. מן ג'הה ת'אניה אלטלאב בדעוא אנה האד אלקראר במס בח'צוציתהם אצ'אפה עלא ד'לכ חיאזה אלג'האז בתחססהם באלאמאן, לאנהם בקדרוא בסהולה יתצלוא לאהלהם."
  },
  {
    "Hebrew": "כיום השימוש ברשתות החברתיות פופולרי מאוד. יש שחושבים שמדובר בכלי שצריך להשתמש בו בזהירות ובהשגחת ההורים כי היו מקרים רבים שצעירים השתמשו ברשתות לרעה וילדים נפלו קורבן למעשים אלו. מצד שני יש שחושבים שמדובר בכלי הכרחי בחיים שלנו שאי אפשר למנוע את השימוש בו, ושניתן גם להפיק הרבה תועלת מהשימוש בו. הסבר לקבוצה למה הצד שקיבלת הוא הצודק.",
    "Arabic": "اليوم استعمال الشبكات الاجتماعية منتشر بكثرة.في الي بفكروا انه هاي اداة يجب استعمالها في حذر  وتحت مراقبة الاهل، لانه صارت مواقف كثيرة الي فيها المراهقين استخدموها لغرض سلبي وكثير ولاد راحوا ضحية هاذ الاستعمال، من جهة ثانية في الي بدعوا انها هاي اداة مهمة جدًا في حياتنا وصعب يتنازلوا عن استعمالها غير انها بتقدر تساعد كثير.اشرح لمجموعتك ليش الجانب الي اخذته هو الصح.",
    "Taatik": "אליום אסתעמאל אלשבכאת אלאג'תמאעיה מנתשר בכת'רה.פי אלי בפכרוא אנה האי אדאה יג'ב אסתעמאלהא פי חד'ר  ותחת מראקבה אלאהל, לאנה צארת מואקף כת'ירה אלי פיהא אלמראהקין אסתח'דמוהא לע'רצ' סלבי וכת'יר ולאד ראחוא צ'חיה האד' אלאסתעמאל, מן ג'הה ת'אניה פי אלי בדעוא אנהא האי אדאה מהמה ג'דא פי חיאתנא וצעב יתנאזלוא ען אסתעמאלהא ע'יר אנהא בתקדר תסאעד כת'יר.אשרח למג'מועתכ ליש אלג'אנב אלי אח'ד'תה הו אלצח."
  },
  {
    "Hebrew": "בבתי ספר רבים חובה על התלמידים ללכת עם תלבושת אחידה, מכיוון שבית הספר אומר שכך כל התלמידים יהיו שווים גם אם הם מרקע סוציו-אקונומי שונה וכך גם בית הספר מציב גבולות ושומר על הסדר. יש תלמידים שמתנגדים לנוהל הזה וטוענים שהוא פוגע בחירותם האישית ובזכותם להביע את עצמם כפי שהם רוצים. הסבר לקבוצה למה הצד שקיבלת הוא הצודק.",
    "Arabic": "في مدارس كثيرة الطلاب مجبرين بالالتزام بلباس موحد، لان المدرسة بتدعي انه في هاي الحالة الطلاب بكونوا متساويين، حتى الي وضعهم الاقتصادي سيء،اضافة انه بهاي الطريقة المدرسة بتفرض الانضباط. في طلاب الي  بعارضو هاذ القرار  وبدعوا انه بمس بحريتهم الشخصية وفي حقهم بالتعبير عن نفسهم. اشرح للمجموعة ليش الوجه الي اخذتها هي صح.",
    "Taatik": "פי מדארס כת'ירה אלטלאב מג'ברין באלאלתזאם בלבאס מוחד, לאן אלמדרסה בתדעי אנה פי האי אלחאלה אלטלאב בכונוא מתסאויין, חתא אלי וצ'עהם אלאקתצאדי סיא,אצ'אפה אנה בהאי אלטריקה אלמדרסה בתפרצ' אלאנצ'באט. פי טלאב אלי  בעארצ'ו האד' אלקראר  ובדעוא אנה במס בחריתהם אלשח'ציה ופי חקהם באלתעביר ען נפסהם. אשרח ללמג'מועה ליש אלוג'ה אלי אח'ד'תהא הי צח."
  }
]
const data = JSON.parse(JSON.stringify(dataJson))