var i = -1
function getItem(){
	i = i + 1;
	if (i == hebrew.length) {
		i = 0;
	}
    document.getElementById("hebrewText").innerHTML = hebrew[i];
	document.getElementById("arabicText").innerHTML = arabic[i];
}

var hebrew = [
".בתקופה האחרונה רכיבה על אופניים חשמליות הפכה לפופולרית במיוחד עבור צעירים רבים. יש אנשים שטוענים שכלי זה הוא טוב לסביבה ותורם לעצמאיות וניידות גם עבור בני נוער. לעומת זאת יש אנשים שחושבים שמדובר בכלי מסוכן שגורם לתאונות רבות ובני נוער הם צעירים מדי בשביל להשתמש בו. הסבר לקבוצה למה הצד שקיבלת הוא הצודק",
".היום הבחינה הפסיכומטרית היא תנאי לקבלה לאוניברסיטה, ומה שהסטודנט יוכל ללמוד ייקבע לפי הציון שיקבל במבחן. יש תלמידים שחושבים שצריך לשנות או להחליף את הבחינה בשיטה אחרת כי לא רואים בה מדד מתאים והוגן לקבלה ללימודים. מצד שני, יש אחרים שטוענים שזו הדרך הכי טובה לסנן את המועמדים הכי טובים עבור כל תואר. הסבר לקבוצה למה הצד שקיבלת הוא הצודק",
".בשנים האחרונות על מנת לקבל תעודת בגרות חייב כל תלמיד לבצע שעות התנדבות בקהילה. יש שחושבים שזו דרך טובה על מנת לעודד את התלמידים להתנדב ולתרום לחברה גם בעתיד. לעומת זאת יש שטוענים שהעובדה שמכריחים את התלמידים לעשות זאת רק תגרום להם לרגשות שליליות ולא תשיג את המטרה. הסבר לקבוצה למה הצד שקיבלת הוא הצודק",
".כיום בני נוער רבים הולכים לעבוד על מנת לחסוך כסף ולהתפתח מבחינה אישית. יש אנשים שטוענים שעדיף שבני הנוער היו מתרכזים בלימודים ולא היו יוצאים לעבוד, גם מכיוון שמעסיקים רבים מנצלים אותם ומספקים להם תנאים לא מספיק טובים. מצד שני יש שחושבים שדבר זה תורם לעצמאות ולחוש האחריות של הצעירים ועוזר להתפתחותם. הסבר לקבוצה למה הצד שקיבלת הוא הצודק",
".כיום, כמעט לכל תלמיד יש טלפון נייד חכם. בחלק מבתי הספר אוסרים על התלמידים להביא אותם איתם, מכיוון שזה יכול להפריע לריכוז שלהם בשיעור וללמידה, וגם מכיוון שהם יכולים להשתמש בו למטרות שליליות. מצד שני, תלמידים מרגישים שזוהי פגיעה בזכויות הפרט שלהם, ובנוסף מרגישים ביטחון בזכות הטלפון מכיוון שכך הם יכולים ליצור בקלות קשר עם הוריהם במקרה חירום. הסבר לקבוצה למה הצד שקיבלת הוא הצודק",
".כיום השימוש ברשתות החברתיות פופולרי מאוד. יש שחושבים שמדובר בכלי שצריך להשתמש בו בזהירות ובהשגחת ההורים כי היו מקרים רבים שצעירים השתמשו ברשתות לרעה וילדים נפלו קורבן למעשים אלו. מצד שני יש שחושבים שמדובר בכלי הכרחי בחיים שלנו שאי אפשר למנוע את השימוש בו, ושניתן גם להפיק הרבה תועלת מהשימוש בו. הסבר לקבוצה למה הצד שקיבלת הוא הצודק",
".בבתי ספר רבים חובה על התלמידים ללכת עם תלבושת אחידה, מכיוון שבית הספר אומר שכך כל התלמידים יהיו שווים גם אם הם מרקע סוציו-אקונומי שונה וכך גם בית הספר מציב גבולות ושומר על הסדר. יש תלמידים שמתנגדים לנוהל הזה וטוענים שהוא פוגע בחירותם האישית ובזכותם להביע את עצמם כפי שהם רוצים. הסבר לקבוצה למה הצד שקיבלת הוא הצודק"
];

var arabic = [
".بالفترة الاخيرة فيه انتشار واسع عند الشباب لاستعمال ع الدراجات الكهربائية. فيه ناس اللي بيدّعو انه هاي الوسيلة غير مضرة للبيئة وبتساعد على استقلالية وتناقل الشباب. من جهة تانية، فيه ناس اللي بيشوفوها كوسيلة خطير الوسيلة اللي بتسبب حوادث كثيرة وانه الشباب مش واعيين كفاية لاستعاملها. اشرح لمجموعتك ليش الموقف اللي احذته  هو الصادق",
".اليوم امتحان البسيخومتري هو شرط اساسي للقبول لجامعة، وعلامة الطالب في الامتحان بتقرر شو بيقدر يتعلم. فيه طلاب اللي بيقولو انه لازم يغيرو او يبدلو الامتحان بطريقة  تانية  لانهم ما بيشوفو فيه مقياس مناسب وعادل للقبول لتعليم. من جهة تانية فيه اللي بيدّعو انه هاي احسن الطريقة لتصفيات المتقدمين لكل لقب. اشرح لمجموعتك ليش الموقف اللي احذته هو الصادق",
".في السنين الاخيرة عشان يحصل التلميد عشهادة بجروت هو مجبور يطوع. في الي بفكروا انها طريقة منيحة لتشجيع الطلاب على التطوع والمساهمه للمجتمع في المستقبل.لكن في الي بدعوا انه اجبار الطلاب عالتطوع.  بس بتخليهم يحسوا بطريقة سلبية. اشرح الجانب الي اخذتة للمجموعة",
".اليوم كثير شباب صغار بروحوا يشتغلوا عشان يوفروا مصاري ويتقدموا ، في ناس بتقول انه احسن انهم يركزوا في التعليم وما يشتغلوا، برضه لانه كثير مشغلين بستغلوهم.من جهة ثانية في الي بفكروا انه هاذ الاشي بساهم في استقلاليتهم ،وانهم يحسوا في المسؤولية. اشرح الجانب الي اخذتة للمجموعة",
".اليوم تقريبًا لكل طالب في جهاز ذكي(بلفون)،في مدارس بتمنع الطلاب يجيبوها عالمدرسة، لانه هاذ ممكن يأثر عتركيزهم في التعليم، وبرضه لانهم ممكن يستعملوه لاهداف سلبية. من جهة ثانية الطلاب بدعوا انه هاد القرار بمس بخصوصيتهم اضافة على ذلك حيازة الجهاز بتحسسهم بالامان، لانهم بقدروا بسهولة يتصلوا لإهلهم",
".اليوم استعمال الشبكات الاجتماعية منتشر بكثرة.في الي بفكروا انه هاي اداة يجب استعمالها في حذر  وتحت مراقبة الاهل، لانه صارت مواقف كثيرة الي فيها المراهقين استخدموها لغرض سلبي وكثير ولاد راحوا ضحية هاذ الاستعمال، من جهة ثانية في الي بدعوا انها هاي اداة مهمة جدًا في حياتنا وصعب يتنازلوا عن استعمالها غير انها بتقدر تساعد كثير.اشرح لمجموعتك ليش الجانب الي اخذته هو الصح",
".في مدارس كثيرة الطلاب مجبرين بالالتزام بلباس موحد، لان المدرسة بتدعي انه في هاي الحالة الطلاب بكونوا متساويين، حتى الي وضعهم الاقتصادي سيء،اضافة انه بهاي الطريقة المدرسة بتفرض الانضباط. في طلاب الي  بعارضو هاذ القرار  وبدعوا انه بمس بحريتهم الشخصية وفي حقهم بالتعبير عن نفسهم. اشرح للمجموعة ليش الوجه الي اخذتها هي صح "
];