var past = [];
function getItem(){
    if (past.length == hebrew.length) {
        past = [];
    }
    while (true) {
        var i = Math.floor(Math.random() * hebrew.length);
        var found = false;
        for (j = 0; j < past.length; j++) {
            if (i == past[j]) {
                found = true;
                break;
            }
        }
        if (!found) {
            break
        }
    }
    past.push(i);
    document.getElementById("hebrewText").innerHTML = hebrew[i];
	document.getElementById("arabicText").innerHTML = arabic[i];
}

var hebrew = [
"רומיאו ויוליה",
"צרפת",
"כנאפה",
"מאדים",
"רמדאן",
"סלפי",
"אלוהים",
"חנוכה",
"אייפון",
"פוקימון",
"ריאל מדריד",
"פלאפל",
"האולימפיאדה",
"קוקה קולה",
"אופניים",
"סושי",
"אייל גולן",
"פסנתר",
"מגדל אייפל",
"מקדונלדס",
"ריהאנה",
"פלייסטיישן",
"העיר מכה",
"אדידס",
"במבה",
"וואטסאפ",
"ניו יורק",
"בוב ספוג",
"גוגל",
"מיקי מאוס",
"יוטיוב",
"אם.טי.וי",
"אדם וחווה",
"אום כולתום",
"פייסבוק",
"משחקי הכס",
"התורה",
"סנטה קלאוס",
"הארי פוטר",
"תל אביב",
"כדורסל",
"פיצה",
"דונלד טראמפ",
"כריסטיאנו רונאלדו",
"איקאה"
];

var arabic = [
" روميو وجولييت",
" فرنسا",
"كنافة",
"المريخ",
"رمضان",
"سيلفي",
"الله",
"عيد الحانوكّا",   
"آي فون", 
"بوكيمون", 
" ريال مدريد", 
"فلافل",
" الألعاب الأولمبية",
" كوكا كولا",
" دراجة هوائية",
"سوشي",
"ايال غولان",
"بيانو",
" برج ايفل",   
"ماكدونالدز", 
"ريانا", 
"بلايستيشن",
"مكا",
"أديداس",
"  بمبا (اكل)",
"واتساب",
"نيويورك",
"سبونج بوب",
"جوجل",
"ميكي ماوس",
"يوتيوب",   
"ام تي في", 
" أدم وحواء", 
"ام كلثوم", 
"فيسبوك",
" صراع العروش",
"التوراة",
" بابا نويل (سانتا كلوز)",
"هاري بوتر",
"تل ابيب",
" كرة السلة",
"بيتزا",   
"دونالد ترامب", 
"كريستيانو رونالدو", 
"ايكيا"
];