function getItem(){
	var i = Math.floor(Math.random() * original.length)
    document.getElementById("originalText").innerHTML = original[i];
	document.getElementById("translationText").innerHTML = translation[i];
}

var original = [
    "سألوا مرة بدوي ليش أنت متجوز أربعة؟  قال لهم : عشان/علشان الأولى مسكرة، الثانية عنبرة، الثالثة مرمرة، والرابعة توديني إلى المقبرة..... ههههههه",
    "!!!جاجة راحت عالجامعة تدرس, فكرك شو درست؟ حقوووووق",
    "في واحد بيشعر حاله كلب. فراح عند الدكتور النفساني. يقله يا دكتور أنا بشعر حالي كلب. قاله كيف تشعر حالك كلب؟ قاله لما أحك حالي... بضل أحك في حالي زي الكلاب, بضل أعوي زي الكلاب. قاله الدكتور من ومتى (امتى) تشعر حالك كلب؟ بيقله من و أنا جرو",
    "واحد بيضل يحط بالشامبو دودة. ليه؟ لأنه مكتوب عليه دعه لثواني معدودة",
    "الخاروف لما تقطع رجليه شو بيصير؟ غيمة",
    "مرة خروف اجا عند ستو وقالها: ستي بدهم يذبحوني! قالتلو: بعيد السر!! حكالها: لا يا ستي ... بعيد الاضحى",
    "مبروك لأخي بمناسبة نجاحو بالثانوية وحصولو على معدل 51.2 وعقبال الدكتوراه. دكتوراه ؟!! يا بنتي اخوكي معدلو ما بيدخلو السجن!  ولك درجة الحرارة أعلى من معدلو",
    "زوجة ضربت زوجها كف . كسرت سنانوا. الزوج: ليش عملتي هيك حبيبتي ؟ الزوجة : لاني لقيت بجيبتك ورقة مكتوب فيها ميمي. قلها : ايه اشتركت بسباق للاحصنه الاسبوع الماضي , وكان اسم حصاني ميمي. الزوجة : اسفه حبيبي ,يا عمري ريتها ايدي نسلت ولاضربتك. تاني يوم : رجعت ضربت كف وقوى. الزوج : شو في اليوم كماااااان ؟ قالتلو : قوم , رد الحصان ع التليفون ",
     "!!طفل عمرو خمس سنين : ماما بحبك<br>. و انا كمان يا روحي<br>!! شاب عمره 18 سنه : ماما بحبك<br>. لو تنبق عيونك مافي مصاري<br>!! رجل عمره 28 : ماما بحبك <br> اذا بتنطبق السما على الارض هالبنت ما بتصير كنتي ",
    "طفل يغني في الباص. اذا ماما حلوه وبابا حلو انا بطلع عسل. اذا ماما فرس وبابا حصان انا بطلع مهر. غصب شوفير الباص وقاله : اذا امك حماره وابوك حمار شو بتطلع ؟ الطفل قلو : بطلع شوفير باص"
];

var translation = [
    "שאלו פעם בדואי למה אתה נשוי לארבע נשים? אמר להם: כיוון שהראשונה היא סוכר, השנייה ענבר, השלישית מרה והרביעית תוביל אותי אל הקבר",
    "!!!תרנגולת הלכה לאוניברסיטה ללמוד, מה היא למדה לדעתך? משפטים",
    "בחור אחד חשב שהוא כלב , אז הלך לפסיכיאטר.אמר לו 'דוקטור ,אני חושב שאני כלב' . שאל אותו הרופא 'איך אתה מרגיש כשאתה כלב ?' . ענה לו הבחור 'כשאני מגרד את עצמי אני מתגרד כמו כלב , ואני נובח כמו כלב' .שאל אותו הרופא 'כמה זמן כבר אתה מרגיש כמו כלב' ? ענה הבחור 'מאז שאני כלבלב…",
    "'היה בחור שהיה שם תמיד בשמפו תולעת. למה? כי כתוב עליו 'תשאיר לכמה שניות ספורות",
    "כבש שאתה קוטע לו את הרגליים למה הוא הופך? ענן",
    ".פעם כבש בא אל סבתא שלו ואמר לה : רוצים לשחוט אותי .אמרה לו: להסיר את הרוע . אמר לה: לא סבתא , בעיד אל אדחא",
    "אחת כתבה: ברכות לאחי על סיום התיכון בממוצע 51.2 ובקרוב הדוקטורט. דוקטורט?! הממוצע של אחיך לא יכניס אותו אפילו לכלא! וואללה, הטמפרטורה בתחזית מזג האוויר יותר גבוהה מהממוצע שלו",
    "אישה נתנה לבעלה כאפה שברה לו את השיניים. הבעל : למה ככה? האישה: מצאתי פתק אצלך כתוב עליו מימי. הבעל: כן ואתמול הייתי במירוץ סוסים , והימרתי על סוס וקראו לו מימי. האישה: אוי בעלי סליחה הלוואי שלא הייתי מרביצה לך. כעבור יום: האישה מעיפה לו עוד כאפה. הבעל: עוד פעם ? האישה: תענה לטלפון , הסוס התקשר ",
     "!ילד בן 5 : אמא אני אוהב אותך<br>. ואני אותך נשמה שלי<br>! בחור בן 18 : אמא אני אוהב אותך<br>. אתה רואה בעיניים שלך שאין לי כסף<br>! גבר בן 28 : אמא אני אוהב אותך<br> אם השמים ידבקו לאדמה , הבחורה הזאת לא תהיה כלתי",
    "ילד שר לעצמו באוטובוס: אם אמא יפה ואבא יפה נולד ילד יפה. אם אמא סוסה ואבא סוס יוצא סייח. הנהג העצבני שאל אותו : אם אמא חמורה ואבא חמור מה תצא? הילד עונה לו: נהג אוטובוס "
];