var past = [];
function getItem(){
    if (past.length == original.length) {
        past = [];
    }
    while (true) {
        var i = Math.floor(Math.random() * original.length);
        var found = false;
        for (j = 0; j < past.length; j++) {
            if (i == past[j]) {
                found = true;
                break;
            }
        }
        if (!found) {
            break
        }
    }
    past.push(i);
    document.getElementById("originalText").innerHTML = original[i];
    document.getElementById("taaticText").innerHTML = taatic[i];
	document.getElementById("translationText").innerHTML = translation[i];
}

var original = [
    "سألوا مرة بدوي ليش أنت متجوز أربعة؟  قال لهم : عشان/علشان الأولى مسكرة، الثانية عنبرة، الثالثة مرمرة، والرابعة توديني إلى المقبرة..... ههههههه",
    "!!!جاجة راحت عالجامعة تدرس, فكرك شو درست؟ حقوووووق",
    "في واحد بيشعر حاله كلب. فراح عند الدكتور النفساني. يقله يا دكتور أنا بشعر حالي كلب. قاله كيف تشعر حالك كلب؟ قاله لما أحك حالي... بضل أحك في حالي زي الكلاب, بضل أعوي زي الكلاب. قاله الدكتور من ومتى (امتى) تشعر حالك كلب؟ بيقله من و أنا جرو",
    "واحد بيضل يحط بالشامبو دودة. ليه؟ لأنه مكتوب عليه دعه لثواني معدودة",
    "الخاروف لما تقطع رجليه شو بيصير؟ غيمة",
    "مرة خروف اجا عند ستو وقالها: ستي بدهم يذبحوني! قالتلو: بعيد السر!! حكالها: لا يا ستي ... بعيد الاضحى",
    "مبروك لأخي بمناسبة نجاحو بالثانوية وحصولو على معدل 51.2 وعقبال الدكتوراه. دكتوراه ؟!! يا بنتي اخوكي معدلو ما بيدخلو السجن!  ولك درجة الحرارة أعلى من معدلو",
    "زوجة ضربت زوجها كف . كسرت سنانوا. الزوج: ليش عملتي هيك حبيبتي ؟ الزوجة : لاني لقيت بجيبتك ورقة مكتوب فيها ميمي. قلها : ايه اشتركت بسباق للاحصنه الاسبوع الماضي , وكان اسم حصاني ميمي. الزوجة : اسفه حبيبي ,يا عمري ريتها ايدي نسلت ولاضربتك. تاني يوم : رجعت ضربت كف وقوى. الزوج : شو في اليوم كماااااان ؟ قالتلو : قوم , رد الحصان ع التليفون ",
     "!!طفل عمرو خمس سنين : ماما بحبك<br>. و انا كمان يا روحي<br>!! شاب عمره 18 سنه : ماما بحبك<br>. لو تنبق عيونك مافي مصاري<br>!! رجل عمره 28 : ماما بحبك <br> اذا بتنطبق السما على الارض هالبنت ما بتصير كنتي ",
    "تنين اذا بلشوا حكي مستحيل يسكتوا : <br>معلق رياضي على مباراة <br>وبنت راجعه من عرس او خطبة ",
    "مبارح حلمت اني دخلت الجنة, بالبداية شكيت انو حلم... بس لما شفت صحابي معي تاكدت انو حلم ههههههههههههههه",
    "واحد خليلي قعده اينشتاين فالتقوا مع بعض قال له اينشتاين: انا باسألك سؤال انت بتسألني سؤال قال له الخليلي بلش انت  قال له اينشتاين انا ما بعرف جوابك باعطيك خمسين دولار وانت ما بتعرف جوابي تعطيني خمس ميت دولار قال له خلص اوك <br>اجا اينشتاين سأل الخليلي سو هي الجاذبية؟ قال له ما باعرف. اجا مسك خمسين دولار الخليلي بعطاها لمين؟ لاينشتاين <br>بعدين اجا سأله الخليلي قال له شوف, شو الاشي اللي بيطلع عالجبل باجرتين وبينزل بتلت اجرين؟ اينشتاين ما عرف. قال له خلص هات خمس ميت دولار اعطاه خمس ميت دولار. <br>اجا اينشتاين سأل الخليلي قال له شو؟ قال له انا برضو ما بعرف",
    "بيقلك في واحد أسموا اخرس وواحد أسموا أخلاقك وواحد أسموا مشاكل <br>في يوم من الأيام ضاع مشاكل راح اخرس وأخلاقك عند الشرطة اخرس قال لاخلاقك ايتناني على الدرج <br>الشرطي سال اخرس شو اسمك قلوا اخرس الشرطي حكالوا وين أخلاقك حكالوا بستناني على الدرج الشرطي شكلك بدور على مشاكل <br>حكالوا كيف عرفت﻿",
    "وحده تقول : جبت رقم جديد وحبيت اعمل مقلب بزوجي <br>نزلت واتساب تاني عالرقم وحاكيتو منو <br>تخيلو طلع ارمل من كذا سنه , الله يرحمني ",
    "بنت بتنزل صورة اظفرها مكسور, بجيها 100 تعليق سلامتك حبيبتي سلامتك ياعمري <br>الشب بنزل صوره السياره وهي قالبة فيه, برنلو اصحابو اذا بدك تبيع الجنطات احكيلي",
    "بالنسبة للي بدي وحدة <br>طويلة <br>وبيضا <br>وبتشتغل <br><br>مالك غير البراد <br>فيها كل هالمواصات",
    "طفل يغني في الباص. اذا ماما حلوه وبابا حلو انا بطلع عسل. اذا ماما فرس وبابا حصان انا بطلع مهر. غصب شوفير الباص وقاله : اذا امك حماره وابوك حمار شو بتطلع ؟ الطفل قلو : بطلع شوفير باص"
];

var taatic = [
    "סאלו מרה בדוי ליש אנת מתג׳וז ארבעה? קאל להם: עשאן אלאולא מסכרה, אלתאניה ענברה, אלתאלתה מרמרה, ואלראבעה תודיני אלא אלמקברה... חחחח",
    "!!!ג׳אג׳ה ראחת עאלג׳אמעה תדרס, פכרכ שו דרסת? חקוווווק",
    "פי ואחד בישער חאלו כלב. פראח ענד אלדכתור אלנפסאני. יקלו יא דכתור אנא בשער חאלי כלב. קאלו כיפ תשער חאלכ כלב? קאלו למא אחכ חאלי... בד׳ל אחכ פי חאלי זי אלכלאב, בד׳ל אעוי זי אלכלאב, קאלו אלדכתור מן אמתא תשער חאלכ כלב? ביקלו מן ואנא ג׳רו",
    "ואחד ביד׳ל יחט באלשאמבו דודה. ליה? לאנו מכתוב עליה דעה לת׳ואני מעדודה",
    "אלח׳ארופ למא תקטע רג׳ליה שו ביס׳יר? ר׳ימה",
    "מרה ח׳רופ אג׳א ענד סתו וקאלהא: סתי בדהם יד׳בחוני! קאלתלו: בעיד אלסר!! חכאלהא: לא יא סתי... בעיד אלאד׳חא",
    "מברוכ לאח׳י במנאסבת נג׳אחו באלתאנוויה וחס׳ולו עלא מעדל 51.2 ועקבאל אלדכתוראה. דכתוראה?!! יא בנתי אח׳וכי מעדלו מא בידח׳לו אלסג׳ן! וולכ דרג׳ת אלחרארה אעלא מן מעדלו",
    "זוג׳ה ד׳רבת זוג׳הא כפ. כסרת סנאנו. אלזוג׳: ליש עמלתי היכ חביבתי? אלזוג׳ה: לאני לקית בג׳יבתכ ורקה מכתוב פיהא מימי. קלהא: איה אשתכרת בסבאק ללאחס׳נה אלאסבוע אלמאד׳י, וכאן אסם חס׳אני מימי. אלזוג׳ה: אספה חביבי, יא עמרי ריתהא אידי נסלת ולא ד׳רבתכ. תאני יום: רג׳עת ד׳רבת כפ וקוי. אלזוג׳: שו פי אליום כמאאאן? קאלתלו: קום, רד אלחס׳אן ע אלתלפון",
    "!!טפל עמרו ח׳מס סנין: מאמא בחבכ<br>.ואנא כמאן יא רוחי<br>!!שאב עמרו 18 סנה: מאמא בחבכ<br>.לו תנבק עיונכ מא פי מס׳ארי<br>!!רג׳ל עמרו 28: מאמא בחבכ<br>אד׳א בתנטבק אלסמאא עלא אלארד׳ האלבנת מא בתס׳יר כנתי",
    "תנין אד׳א בלשו חכי מסתחיל יסכתו: <br>מעלק ריאד׳י עלא מבאראה <br>ובנת ראג׳עה מן ערס או ח׳טבה",
    "מבארח חלמת אני דח׳לת אלג׳נה, באלבדאיה שכית אנו חלם... בס למא שפת ס׳חאבי מעי תאכדת אנו חלם חחחחחחחח",
    "ואחד ח׳לילי קעדו אינשתאין פאלתקו מע בעד׳ קאל לו אינשתאין: אנא באסאלכ סואל אנת בתסאלני סואל קאל לו אלח׳לילי בלש אנת קאל לו אינשתאין אנא מא בערפ ג׳ואבכ באעטיכ ח׳מסין דולאר ואנת מא בתערפ ג׳ואבי תעטיני ח׳מס מית דולאר קאל לו ח׳לס׳ אוכ <br>אג׳א אינשתאין סאל אלח׳לילי שו הי אלג׳אד׳ביה? קאל לו מא באערפ. אג׳א מסכ ח׳מסין דולאר אלח'לילי בעטאהא למין? לאינשתאין <br>בעדין אג׳א סאלו אלח׳לילי קאל לו שופ, שו אלאשי אללי ביטלע עאלג׳בל באג׳רתין ובינזל בתלת אג׳רין? אינשתאין מא ערפ. קאל לו ח׳לס׳ האת ח'מס מית דולאר אעטאה ח'מס מית דולאר. <br>אג׳א אינשתאין סאל אלח'לילי קאל לו שו? קאל לו אנא ברד׳ו מא בערפ",
    "ביקלכ פי ואחד אסמו אח׳רס וואחד אסמו אח׳לאקכ וואחד אסמו משאכל <br>פי יום מן אלאיאם ד׳אע משאכל ראח אח׳רס ואח׳לאקכ ענד אלשרטה אח׳רס קאל לאח׳לאקכ אסתנאני עלא אלדרג <br>אלשרטי סאל אח׳רס שו אסמכ קאלו אח׳רס אלשרטי חכאלו וון אח׳לאקכ חכאלו בסתנאני עלא אלדרג׳ אלשרטי שכלכ בדוור עלא משאכל <br>חכאלו כיפ ערפת",
    "וחדה תקול: רקם ג׳דיד וחבית אעמל מקלב בזוג׳י <br>נזלת וואתסאב תאני עאלרקם וחאכיתו מנו <br>תח׳ילו טלע ארמל מן כד׳א סנה, אללה ירחמני",
    "בנת בתנזל ס׳ורה אז׳פרהא מכסור, בג׳יבהא 100 תעליק סלאמתכ חביבתי סלאמתכ יא עמרי <br>אלשב בנזל ס׳ורה אלסיארה והי קאלבה פיה, ברנלו אס׳חאבו אד׳א בדכ תביע אלג׳נטאת אחכילי",
    "באלנסבה אללי בדי וחדה <br>טוילה <br>ביד׳א <br>ובתשתר׳ל <br><br>מאלכ ר׳יר אלבראד <br>פיהא כל האלמואס׳את",
    "טפל יר׳ני פי אלבאס׳. אד׳א מאמא חלוה ובאבא חלו אנא בטלע עסל. אד׳א מאמא פרס ובאבא חס׳אן אנא בטלע מהר. ר׳ד׳ב שופיר אלבאס׳ וקאלו: אד׳א אמכ חמארה ואבוכ חמאר שו בתטלע? אלטפל קלו: בטלע שופיר באס"
];

var translation = [
    "שאלו פעם בדואי למה אתה נשוי לארבע נשים? אמר להם: כיוון שהראשונה היא סוכר, השנייה ענבר, השלישית מרה והרביעית תוביל אותי אל הקבר",
    "!!!תרנגולת הלכה לאוניברסיטה ללמוד, מה היא למדה לדעתך? משפטים",
    "בחור אחד חשב שהוא כלב , אז הלך לפסיכיאטר.אמר לו 'דוקטור ,אני חושב שאני כלב' . שאל אותו הרופא 'איך אתה מרגיש כשאתה כלב ?' . ענה לו הבחור 'כשאני מגרד את עצמי אני מתגרד כמו כלב , ואני נובח כמו כלב' .שאל אותו הרופא 'כמה זמן כבר אתה מרגיש כמו כלב' ? ענה הבחור 'מאז שאני כלבלב…",
    "'היה בחור שהיה שם תמיד בשמפו תולעת. למה? כי כתוב עליו 'תשאיר לכמה שניות ספורות",
    "כבש שאתה קוטע לו את הרגליים למה הוא הופך? ענן",
    ".פעם כבש בא אל סבתא שלו ואמר לה : רוצים לשחוט אותי .אמרה לו: להסיר את הרוע . אמר לה: לא סבתא , בעיד אל אדחא",
    "אחת כתבה: ברכות לאחי על סיום התיכון בממוצע 51.2 ובקרוב הדוקטורט. דוקטורט?! הממוצע של אחיך לא יכניס אותו אפילו לכלא! וואללה, הטמפרטורה בתחזית מזג האוויר יותר גבוהה מהממוצע שלו",
    "אישה נתנה לבעלה כאפה שברה לו את השיניים. הבעל : למה ככה? האישה: מצאתי פתק אצלך כתוב עליו מימי. הבעל: כן ואתמול הייתי במירוץ סוסים , והימרתי על סוס וקראו לו מימי. האישה: אוי בעלי סליחה הלוואי שלא הייתי מרביצה לך. כעבור יום: האישה מעיפה לו עוד כאפה. הבעל: עוד פעם ? האישה: תענה לטלפון , הסוס התקשר ",
     "!ילד בן 5 : אמא אני אוהב אותך<br>. ואני אותך נשמה שלי<br>! בחור בן 18 : אמא אני אוהב אותך<br>. אתה רואה בעיניים שלך שאין לי כסף<br>! גבר בן 28 : אמא אני אוהב אותך<br> אם השמים ידבקו לאדמה , הבחורה הזאת לא תהיה כלתי",
    "שתיים אם התחילו לדבר לעולם לא ישתקו <br>- פרשן ספורט במשחק <br>-ובת שחוזרת מחתונה או אירוסין",
    "אתמול חלמתי שנכנסתי לגן עדן, בהתחלה חשדתי שזה חלום... אבל כשראיתי את החברים שלי איתי קיבלתי אישור שזה חלום",
    "חברוני אחד ישב ליד איינשטיין והם נפגשו אחד עם השני, איינשטיין אמר לו אני אשאל אותך שאלה ואתה תשאל אותי שאלה אמר לו החברוני תתחיל אתה. אמר לו אם אני לא יודע את התשובה אני אתן לך חמישים דולר ואם אתה לא תדע תיתן לי חמש מאות דולר. אמר לו בסדר אוקיי.  <br>איינשטיין שאל את החברוני מה הוא כח הכבידה ? אמר לו אני לא יודע, לקח חמישים דולר נתן לאיינשטיין. <br>אחר כך שאל אותו הח'לילי אמר לו מה הדבר שעולה על ההר בשתי רגליים ויודע בשלוש רגליים? איינשטיין לא ידע, אמר לו חלאס תן חמש מאות דולר, נתן לו חמש מאות דולר. <br>בא איינשטיין שאל אותו מה זה? אמר לו גם אני לא יודע",
    "היה גבר ששמו ’שתוק’ ואחד ששמו מוסר ועוד אחד ששמו ׳בעיות׳ ... <br>יום אחד בעיות הלך לאיבוד, ושתוק הלך עם מוסר למשטרה. שתוק אמר למוסר : חכה לי על המדרגות. <br>והשוטר שאל את שתוק: מה שמך ? ושתוק ענה: שתוק! ואמר לו: איפה המוסר שלך (המוסר שלך) ושתוק ענה: מחכה לי ליד המדרגות. והשוטר אמר: נראה כאילו אתה מחפש בעיות (צרות) ... <br>והוא אמר: איך ידעת",
    "אחת אומרת : הבאתי מספר (טלפון) חדש ובא לי לעשות קטע לבעלי <br>אני אוריד וואטסאפ שני על המספר החדשה ואני אדבר עם בעלי ממנו <br>ואז הוא הזדהה למספר הלא מוכר כאלמן מזה שנה … שאללה ירחם עליי",
    "בחורה מעלה תמונה של צפורן שבורה, מגיעות 100 תגובות 'תהיי בריאה חיים שלי' <br>בחור מעלה תמונה של האוטו שהתהפך כשהוא בפנים, החברים מצלצלים 'אם תרצה למכור את הג'נטים אז תגיד",
    "לי מתאימה מישהי שהיא :  <br>גבוהה <br>לבנה <br>ועובדת . <br><br>מה אתה צריך חוץ ממקרר ? <br>יש לו את כל הדרישות",
    "ילד שר לעצמו באוטובוס: אם אמא יפה ואבא יפה נולד ילד יפה. אם אמא סוסה ואבא סוס יוצא סייח. הנהג העצבני שאל אותו : אם אמא חמורה ואבא חמור מה תצא? הילד עונה לו: נהג אוטובוס "
];