var past = [];
function getItem(){
    if (past.length == dataJson.length) {
        past = [];
    }
    while (true) {
        var i = Math.floor(Math.random() * dataJson.length);
        var found = false;
        for (j = 0; j < past.length; j++) {
            if (i == past[j]) {
                found = true;
                break;
            }
        }
        if (!found) {
            break
        }
    }
    past.push(i);
	document.getElementById("originalText").innerHTML = data[i].Original;
	document.getElementById("taatikText").innerHTML = data[i].Taatik;
	document.getElementById("translationText").innerHTML = data[i].Translation;
}

const dataJson = [
  {
    "Original": "سألوا مرة بدوي ليش أنت متجوز أربعة؟  قال لهم : عشان/علشان الأولى مسكرة، الثانية عنبرة، الثالثة مرمرة، والرابعة توديني إلى المقبرة..... ههههههه",
    "Taatik": "סאלוא מרה בדוי ליש אנת מתג'וז ארבעה?  קאל להם : עשאנ/עלשאן אלאולא מסכרה, אלת'אניה ענברה, אלת'אלת'ה מרמרה, ואלראבעה תודיני אלא אלמקברה..... חחחחחח",
    "Translation": "שאלו פעם בדואי למה אתה נשוי לארבע נשים? אמר להם: כיוון שהראשונה היא סוכר, השנייה ענבר, השלישית מרה והרביעית תוביל אותי אל הקבר"
  },
  {
    "Original": "جاجة راحت عالجامعة تدرس, فكرك شو درست؟ حقوووووق!!!",
    "Taatik": "ג'אג'ה ראחת עאלג'אמעה תדרס, פכרכ שו דרסת? חקוווווק!!!",
    "Translation": "!!!תרנגולת הלכה לאוניברסיטה ללמוד, מה היא למדה לדעתך? משפטים"
  },
  {
    "Original": "في واحد بيشعر حاله كلب. فراح عند الدكتور النفساني. يقله يا دكتور أنا بشعر حالي كلب. قاله كيف تشعر حالك كلب؟ قاله لما أحك حالي... بضل أحك في حالي زي الكلاب, بضل أعوي زي الكلاب. قاله الدكتور من ومتى (امتى) تشعر حالك كلب؟ بيقله من و أنا جرو",
    "Taatik": "פי ואחד בישער חאלה כלב. פראח ענד אלדכתור אלנפסאני. יקלה יא דכתור אנא בשער חאלי כלב. קאלה כיף תשער חאלכ כלב? קאלה למא אחכ חאלי... בצ'ל אחכ פי חאלי זי אלכלאב, בצ'ל אעוי זי אלכלאב. קאלה אלדכתור מן ומתא (אמתא) תשער חאלכ כלב? ביקלה מן ו אנא ג'רו",
    "Translation": "בחור אחד חשב שהוא כלב , אז הלך לפסיכיאטר.אמר לו 'דוקטור ,אני חושב שאני כלב' . שאל אותו הרופא 'איך אתה מרגיש כשאתה כלב ?' . ענה לו הבחור 'כשאני מגרד את עצמי אני מתגרד כמו כלב , ואני נובח כמו כלב' .שאל אותו הרופא 'כמה זמן כבר אתה מרגיש כמו כלב' ? ענה הבחור 'מאז שאני כלבלב…"
  },
  {
    "Original": "واحد بيضل يحط بالشامبو دودة. ليه؟ لأنه مكتوب عليه دعه لثواني معدودة",
    "Taatik": "ואחד ביצ'ל יחט באלשאמבו דודה. ליה? לאנה מכתוב עליה דעה לת'ואני מעדודה",
    "Translation": "היה בחור שהיה שם תמיד בשמפו תולעת. למה? כי כתוב עליו 'תשאיר לכמה שניות ספורות"
  },
  {
    "Original": "الخاروف لما تقطع رجليه شو بيصير؟ غيمة",
    "Taatik": "אלח'ארוף למא תקטע רג'ליה שו ביציר? ע'ימה",
    "Translation": "כבש שאתה קוטע לו את הרגליים למה הוא הופך? ענן"
  },
  {
    "Original": "مرة خروف اجا عند ستو وقالها: ستي بدهم يذبحوني! قالتلو: بعيد السر!! حكالها: لا يا ستي ... بعيد الاضحى",
    "Taatik": "מרה ח'רוף אג'א ענד סתו וקאלהא: סתי בדהם יד'בחוני! קאלתלו: בעיד אלסר!! חכאלהא: לא יא סתי ... בעיד אלאצ'חא",
    "Translation": ".פעם כבש בא אל סבתא שלו ואמר לה : רוצים לשחוט אותי .אמרה לו: להסיר את הרוע . אמר לה: לא סבתא , בעיד אל אדחא"
  },
  {
    "Original": "مبروك لأخي بمناسبة نجاحو بالثانوية وحصولو على معدل 51.2 وعقبال الدكتوراه. دكتوراه ؟!! يا بنتي اخوكي معدلو ما بيدخلو السجن!  ولك درجة الحرارة أعلى من معدلو",
    "Taatik": "מברוכ לאח'י במנאסבה נג'אחו באלת'אנויה וחצולו עלא מעדל 51.2 ועקבאל אלדכתוראה. דכתוראה ?!! יא בנתי אח'וכי מעדלו מא בידח'לו אלסג'נ!  ולכ דרג'ה אלחרארה אעלא מן מעדלו",
    "Translation": "אחת כתבה: ברכות לאחי על סיום התיכון בממוצע 51.2 ובקרוב הדוקטורט. דוקטורט?! הממוצע של אחיך לא יכניס אותו אפילו לכלא! וואללה, הטמפרטורה בתחזית מזג האוויר יותר גבוהה מהממוצע שלו"
  },
  {
    "Original": "زوجة ضربت زوجها كف . كسرت سنانوا. الزوج: ليش عملتي هيك حبيبتي ؟ الزوجة : لاني لقيت بجيبتك ورقة مكتوب فيها ميمي. قلها : ايه اشتركت بسباق للاحصنه الاسبوع الماضي , وكان اسم حصاني ميمي. الزوجة : اسفه حبيبي ,يا عمري ريتها ايدي نسلت ولاضربتك. تاني يوم : رجعت ضربت كف وقوى. الزوج : شو في اليوم كماااااان ؟ قالتلو : قوم , رد الحصان ع التليفون",
    "Taatik": "זוג'ה צ'רבת זוג'הא כף . כסרת סנאנוא. אלזוג': ליש עמלתי היכ חביבתי ? אלזוג'ה : לאני לקית בג'יבתכ ורקה מכתוב פיהא מימי. קלהא : איה אשתרכת בסבאק ללאחצנה אלאסבוע אלמאצ'י , וכאן אסם חצאני מימי. אלזוג'ה : אספה חביבי ,יא עמרי ריתהא אידי נסלת ולאצ'רבתכ. תאני יום : רג'עת צ'רבת כף וקוא. אלזוג' : שו פי אליום כמאאאאאאן ? קאלתלו : קום , רד אלחצאן ע אלתליפון",
    "Translation": "אישה נתנה לבעלה כאפה שברה לו את השיניים. הבעל : למה ככה? האישה: מצאתי פתק אצלך כתוב עליו מימי. הבעל: כן ואתמול הייתי במירוץ סוסים , והימרתי על סוס וקראו לו מימי. האישה: אוי בעלי סליחה הלוואי שלא הייתי מרביצה לך. כעבור יום: האישה מעיפה לו עוד כאפה. הבעל: עוד פעם ? האישה: תענה לטלפון , הסוס התקשר"
  },
  {
    "Original": "طفل عمرو خمس سنين : ماما بحبك!!<br>و انا كمان يا روحي.<br>شاب عمره 18 سنه : ماما بحبك!!<br>لو تنبق عيونك مافي مصاري.<br>رجل عمره 28 : ماما بحبك!!<br> اذا بتنطبق السما على الارض هالبنت ما بتصير كنتي",
    "Taatik": "טפל עמרו ח'מס סנין : מאמא בחבכ!!<br>ו אנא כמאן יא רוחי.<br>שאב עמרה 18 סנה : מאמא בחבכ!!<br>לו תנבק עיונכ מאפי מצארי.<br>רג'ל עמרה 28 : מאמא בחבכ!!<br> אד'א בתנטבק אלסמא עלא אלארצ' האלבנת מא בתציר כנתי",
    "Translation": "!ילד בן 5 : אמא אני אוהב אותך<br>. ואני אותך נשמה שלי<br>! בחור בן 18 : אמא אני אוהב אותך<br>. אתה רואה בעיניים שלך שאין לי כסף<br>! גבר בן 28 : אמא אני אוהב אותך<br> אם השמים ידבקו לאדמה , הבחורה הזאת לא תהיה כלתי"
  },
  {
    "Original": "تنين اذا بلشوا حكي مستحيل يسكتوا : <br>معلق رياضي على مباراة <br>وبنت راجعه من عرس او خطبة",
    "Taatik": "תנין אד'א בלשוא חכי מסתחיל יסכתוא : <br>מעלק ריאצ'י עלא מבאראה <br>ובנת ראג'עה מן ערס או ח'טבה",
    "Translation": "שתיים אם התחילו לדבר לעולם לא ישתקו <br>- פרשן ספורט במשחק <br>-ובת שחוזרת מחתונה או אירוסין"
  },
  {
    "Original": "مبارح حلمت اني دخلت الجنة, بالبداية شكيت انو حلم... بس لما شفت صحابي معي تاكدت انو حلم ههههههههههههههه",
    "Taatik": "מבארח חלמת אני דח'לת אלג'נה, באלבדאיה שכית אנו חלם... בס למא שפת צחאבי מעי תאכדת אנו חלם חחחחחחחחחחחחחחח",
    "Translation": "אתמול חלמתי שנכנסתי לגן עדן, בהתחלה חשדתי שזה חלום... אבל כשראיתי את החברים שלי איתי קיבלתי אישור שזה חלום"
  },
  {
    "Original": "واحد خليلي قعده اينشتاين فالتقوا مع بعض قال له اينشتاين: انا باسألك سؤال انت بتسألني سؤال قال له الخليلي بلش انت  قال له اينشتاين انا ما بعرف جوابك باعطيك خمسين دولار وانت ما بتعرف جوابي تعطيني خمس ميت دولار قال له خلص اوك <br>اجا اينشتاين سأل الخليلي شو هي الجاذبية؟ قال له ما باعرف. اجا مسك خمسين دولار الخليلي بعطاها لمين؟ لاينشتاين <br>بعدين اجا سأله الخليلي قال له شوف, شو الاشي اللي بيطلع عالجبل باجرتين وبينزل بتلت اجرين؟ اينشتاين ما عرف. قال له خلص هات خمس ميت دولار اعطاه خمس ميت دولار. <br>اجا اينشتاين سأل الخليلي قال له شو؟ قال له انا برضو ما بعرف",
    "Taatik": "ואחד ח'לילי קעדה אינשתאין פאלתקוא מע בעצ' קאל לה אינשתאינ: אנא באסאלכ סאאל אנת בתסאלני סאאל קאל לה אלח'לילי בלש אנת  קאל לה אינשתאין אנא מא בערף ג'ואבכ באעטיכ ח'מסין דולאר ואנת מא בתערף ג'ואבי תעטיני ח'מס מית דולאר קאל לה ח'לצ אוכ <br>אג'א אינשתאין סאל אלח'לילי שו הי אלג'אד'ביה? קאל לה מא באערף. אג'א מסכ ח'מסין דולאר אלח'לילי בעטאהא למינ? לאינשתאין <br>בעדין אג'א סאלה אלח'לילי קאל לה שוף, שו אלאשי אללי ביטלע עאלג'בל באג'רתין ובינזל בתלת אג'רינ? אינשתאין מא ערף. קאל לה ח'לצ האת ח'מס מית דולאר אעטאה ח'מס מית דולאר. <br>אג'א אינשתאין סאל אלח'לילי קאל לה שו? קאל לה אנא ברצ'ו מא בערפ",
    "Translation": "חברוני אחד ישב ליד איינשטיין והם נפגשו אחד עם השני, איינשטיין אמר לו אני אשאל אותך שאלה ואתה תשאל אותי שאלה אמר לו החברוני תתחיל אתה. אמר לו אם אני לא יודע את התשובה אני אתן לך חמישים דולר ואם אתה לא תדע תיתן לי חמש מאות דולר. אמר לו בסדר אוקיי.  <br>איינשטיין שאל את החברוני מה הוא כח הכבידה ? אמר לו אני לא יודע, לקח חמישים דולר נתן לאיינשטיין. <br>אחר כך שאל אותו הח'לילי אמר לו מה הדבר שעולה על ההר בשתי רגליים ויודע בשלוש רגליים? איינשטיין לא ידע, אמר לו חלאס תן חמש מאות דולר, נתן לו חמש מאות דולר. <br>בא איינשטיין שאל אותו מה זה? אמר לו גם אני לא יודע"
  },
  {
    "Original": "بيقلك في واحد أسموا اخرس وواحد أسموا أخلاقك وواحد أسموا مشاكل <br>في يوم من الأيام ضاع مشاكل راح اخرس وأخلاقك عند الشرطة اخرس قال لاخلاقك ايتناني على الدرج <br>الشرطي سال اخرس شو اسمك قلوا اخرس الشرطي حكالوا وين أخلاقك حكالوا بستناني على الدرج الشرطي شكلك بدور على مشاكل <br>حكالوا كيف عرفت",
    "Taatik": "ביקלכ פי ואחד אסמוא אח'רס וואחד אסמוא אח'לאקכ וואחד אסמוא משאכל <br>פי יום מן אלאיאם צ'אע משאכל ראח אח'רס ואח'לאקכ ענד אלשרטה אח'רס קאל לאח'לאקכ איתנאני עלא אלדרג' <br>אלשרטי סאל אח'רס שו אסמכ קלוא אח'רס אלשרטי חכאלוא וין אח'לאקכ חכאלוא בסתנאני עלא אלדרג' אלשרטי שכלכ בדור עלא משאכל <br>חכאלוא כיף ערפת",
    "Translation": "היה גבר ששמו ’שתוק’ ואחד ששמו מוסר ועוד אחד ששמו ׳בעיות׳ ... <br>יום אחד בעיות הלך לאיבוד, ושתוק הלך עם מוסר למשטרה. שתוק אמר למוסר : חכה לי על המדרגות. <br>והשוטר שאל את שתוק: מה שמך ? ושתוק ענה: שתוק! ואמר לו: איפה המוסר שלך (המוסר שלך) ושתוק ענה: מחכה לי ליד המדרגות. והשוטר אמר: נראה כאילו אתה מחפש בעיות (צרות) ... <br>והוא אמר: איך ידעת"
  },
  {
    "Original": "وحده تقول : جبت رقم جديد وحبيت اعمل مقلب بزوجي <br>نزلت واتساب تاني عالرقم وحاكيتو منو <br>تخيلو طلع ارمل من كذا سنه , الله يرحمني",
    "Taatik": "וחדה תקול : ג'בת רקם ג'דיד וחבית אעמל מקלב בזוג'י <br>נזלת ואתסאב תאני עאלרקם וחאכיתו מנו <br>תח'ילו טלע ארמל מן כד'א סנה , אללה ירחמני",
    "Translation": "אחת אומרת : הבאתי מספר (טלפון) חדש ובא לי לעשות קטע לבעלי <br>אני אוריד וואטסאפ שני על המספר החדשה ואני אדבר עם בעלי ממנו <br>ואז הוא הזדהה למספר הלא מוכר כאלמן מזה שנה … שאללה ירחם עליי"
  },
  {
    "Original": "بنت بتنزل صورة اظفرها مكسور, بجيها 100 تعليق سلامتك حبيبتي سلامتك ياعمري <br>الشب بنزل صوره السياره وهي قالبة فيه, برنلو اصحابو اذا بدك تبيع الجنطات احكيلي",
    "Taatik": "בנת בתנזל צורה אט'פרהא מכסור, בג'יהא 100 תעליק סלאמתכ חביבתי סלאמתכ יאעמרי <br>אלשב בנזל צורה אלסיארה והי קאלבה פיה, ברנלו אצחאבו אד'א בדכ תביע אלג'נטאת אחכילי",
    "Translation": "בחורה מעלה תמונה של צפורן שבורה, מגיעות 100 תגובות 'תהיי בריאה חיים שלי' <br>בחור מעלה תמונה של האוטו שהתהפך כשהוא בפנים, החברים מצלצלים 'אם תרצה למכור את הג'נטים אז תגיד"
  },
  {
    "Original": "بالنسبة للي بدي وحدة <br>طويلة <br>وبيضا <br>وبتشتغل <br><br>مالك غير البراد <br>فيها كل هالمواصات",
    "Taatik": "באלנסבה ללי בדי וחדה <br>טוילה <br>וביצ'א <br>ובתשתע'ל <br><br>מאלכ ע'יר אלבראד <br>פיהא כל האלמואצאת",
    "Translation": "לי מתאימה מישהי שהיא :  <br>גבוהה <br>לבנה <br>ועובדת . <br><br>מה אתה צריך חוץ ממקרר ? <br>יש לו את כל הדרישות"
  },
  {
    "Original": "طفل يغني في الباص. اذا ماما حلوه وبابا حلو انا بطلع عسل. اذا ماما فرس وبابا حصان انا بطلع مهر. غصب شوفير الباص وقاله : اذا امك حماره وابوك حمار شو بتطلع ؟ الطفل قلو : بطلع شوفير باص",
    "Taatik": "טפל יע'ני פי אלבאצ. אד'א מאמא חלוה ובאבא חלו אנא בטלע עסל. אד'א מאמא פרס ובאבא חצאן אנא בטלע מהר. ע'צב שופיר אלבאצ וקאלה : אד'א אמכ חמארה ואבוכ חמאר שו בתטלע ? אלטפל קלו : בטלע שופיר באצ",
    "Translation": "ילד שר לעצמו באוטובוס: אם אמא יפה ואבא יפה נולד ילד יפה. אם אמא סוסה ואבא סוס יוצא סייח. הנהג העצבני שאל אותו : אם אמא חמורה ואבא חמור מה תצא? הילד עונה לו: נהג אוטובוס"
  }
]
const data = JSON.parse(JSON.stringify(dataJson))