var past = [];
var cur = -1;
function getNext(){
	cur++;
	if (cur === past.length) {
		while (true) {
        var i = Math.floor(Math.random() * dataJson.length);
        var found = false;
        for (j = 0; j < past.length; j++) {
            if (i == past[j]) {
                found = true;
                break;
            }
        }
        if (!found) {
            break;
        }
    }
    past.push(i);
	} else {
		i = past[cur];
	}
	displayContent(cur, i);	
}

function getPrev(){
	cur--;
	i = past[cur];
	displayContent(cur, i);	
}

function getNextButton(cur) {
	nextButton = `<a class="circle-button" onclick="getNext()" role="button">
		  <span class="glyphicon glyphicon glyphicon-chevron-left my-activity-button-single"></span>
        </a>`;
	if (cur === dataJson.length-1) {
		nextButton = `<a class="circle-button invisible" onclick="getNext()" role="button">
		  <span class="glyphicon glyphicon glyphicon-chevron-left my-activity-button-single"></span>
        </a>`;	
	}	
	return nextButton;
}

function getPrevButton(cur) {
	prevButton = `<a class="circle-button" onclick="getPrev()" role="button">
		  <span class="glyphicon glyphicon glyphicon-chevron-right my-activity-button-single"></span>
        </a>`;
	if (cur === 0) {
		prevButton = `<a class="circle-button invisible" onclick="getPrev()" role="button">
		  <span class="glyphicon glyphicon glyphicon-chevron-right my-activity-button-single"></span>
        </a>`;
	}	
	return prevButton;
}

function displayContent(cur, i) {
	nextButton = getNextButton(cur);
	prevButton = getPrevButton(cur);
	content = getContentRectWithSpecificOrder();
	document.getElementById("button-and-text").innerHTML = nextButton + content + prevButton;
	displayContentBySpecificOrder(i);
}

function getContentRectWithSpecificOrder() {
	content = `<div class="rectangle">
                <h2 class="rtl" id="hebrewText"></h3>
		<h2 class="rtl" id="arabicText"></h3>
        <h2 class="rtl" id="taatikText"></h3>
            </div>`;
	return content;		
}

function displayContentBySpecificOrder(i) {
	document.getElementById("hebrewText").innerHTML = data[i].Hebrew;
	document.getElementById("arabicText").innerHTML = data[i].Arabic;
	document.getElementById("taatikText").innerHTML = data[i].Taatik;
}

const dataJson = [
  {
    "Hebrew": "מה הספר האחרון שקראת?",
    "Arabic": "شو اخر كتاب قرأته؟",
    "Taatik": "שו אח'ר כתאב קראתה?"
  },
  {
    "Hebrew": "אם היית יכול/ה לעבוד בכל מקצוע, באיזה מקצוע זה היה?",
    "Arabic": "اذا كنت بتقدر تشتغل بكل موضوع بأي موضوع كنت بتشتغل؟",
    "Taatik": "אד'א כנת בתקדר תשתע'ל בכל מוצ'וע באי מוצ'וע כנת בתשתע'ל?"
  },
  {
    "Hebrew": "אם היית יכול לתת לילד עצה אחת לחיים- מה היית אומר?",
    "Arabic": "اذا كنت بدك تعطي لولد نصيحة واحدة للحياة شو كنت بتقوله؟",
    "Taatik": "אד'א כנת בדכ תעטי לולד נציחה ואחדה ללחיאה שו כנת בתקולה?"
  },
  {
    "Hebrew": "כלבים או חתולים?",
    "Arabic": "بساس ولا كلاب؟",
    "Taatik": "בסאס ולא כלאב?"
  },
  {
    "Hebrew": "מהם שמות החיבה שלך?",
    "Arabic": "شو القابك؟",
    "Taatik": "שו אלקאבכ?"
  },
  {
    "Hebrew": "מה הדבר שתמיד רצית לעשות אבל עדיין לא הספקת?",
    "Arabic": "شو الاشي اللي دايما بدك تعملو بس بعدك مش عاملو؟",
    "Taatik": "שו אלאשי אללי דאימא בדכ תעמלו בס בעדכ מש עאמלו?"
  },
  {
    "Hebrew": "אם היו אומרים לך שנותרו לך רק כמה חודשים לחיות. מה היית עושה?",
    "Arabic": "اذا حكولك انو ضل بس كم شهر تعيش، شو كنت بتعمل؟",
    "Taatik": "אד'א חכולכ אנו צ'ל בס כם שהר תעיש، שו כנת בתעמל?"
  },
  {
    "Hebrew": "אם היית יכול/ה להיות כל חיה, מה היית ולמה?",
    "Arabic": "اذا كنت بتقدر تكون كل حيوان، شو كنت بتكون؟",
    "Taatik": "אד'א כנת בתקדר תכון כל חיואנ، שו כנת בתכונ?"
  },
  {
    "Hebrew": "אם היה לך מיליון דולר, מה היית עושה?",
    "Arabic": "اذا كان معك مليون دولار شو كنت بتعمل؟",
    "Taatik": "אד'א כאן מעכ מליון דולאר שו כנת בתעמל?"
  },
  {
    "Hebrew": "ספר משהו שאנשים לא יודעים עליך",
    "Arabic": "احكي اشي الناس ما بتعرفوا عنك",
    "Taatik": "אחכי אשי אלנאס מא בתערפוא ענכ"
  },
  {
    "Hebrew": "אם היית יכול/ה לפגוש אישיות מפורסמת, מי זה היה? על מה היית מדבר איתו?",
    "Arabic": "اذا كنت بتقدر تقابل شخصية مشهورة مين كنت بتنقي؟ وعن شو بتحكي معو؟",
    "Taatik": "אד'א כנת בתקדר תקאבל שח'ציה משהורה מין כנת בתנקי? וען שו בתחכי מעו?"
  },
  {
    "Hebrew": "הבית שלך עולה באש. מה הדבר הראשון שאת/ה מציל/ה?",
    "Arabic": "اذا بيتك عم يحترق، شو اول شي بتنقذو؟",
    "Taatik": "אד'א ביתכ עם יחתרק، שו אול שי בתנקד'ו?"
  },
  {
    "Hebrew": "אם היית יכול/ה להגיע לכל מקום בעולם, לאן היית הולך/ת?",
    "Arabic": "اذا فيك\\ فيكي توصلي لكل مكان بالعالم ؟ لوين كنت بتروح \\ بتروحي ؟",
    "Taatik": "אד'א פיכ\\ פיכי תוצלי לכל מכאן באלעאלם ? לוין כנת בתרוח \\ בתרוחי ?"
  },
  {
    "Hebrew": "איפה את/ה רואה את עצמך 10 שנים מהיום?",
    "Arabic": "وين بتشوف\\ بتشوفي حالك بعد 10 سنين من اليوم ؟",
    "Taatik": "וין בתשופ\\ בתשופי חאלכ בעד 10 סנין מן אליום ?"
  },
  {
    "Hebrew": "מה הדבר שהכי היית רוצה לעשות ולמה?",
    "Arabic": "شو اكتر شي كنت بدك تعلمو\\ تعمليه وليش؟",
    "Taatik": "שו אכתר שי כנת בדכ תעלמו\\ תעמליה וליש?"
  },
  {
    "Hebrew": "מהו הדבר שאתה הכי מעריך/ה אצל אנשים/ חברים?",
    "Arabic": "شو اكثر اشي بتقدرو عند ناس/صحاب؟",
    "Taatik": "שו אכת'ר אשי בתקדרו ענד נאס/צחאב?"
  },
  {
    "Hebrew": "מה היית רוצה ללמוד ולמה?",
    "Arabic": "شو كنت بتحب تتعلم وليش؟",
    "Taatik": "שו כנת בתחב תתעלם וליש?"
  },
  {
    "Hebrew": "האם היית רוצה להתפרסם ואם כן בזכות מה?",
    "Arabic": "هل كنت بدك تصير مشهور\\ مشهوره ؟ واذا اه , بشو؟",
    "Taatik": "הל כנת בדכ תציר משהור\\ משהורה ? ואד'א אה , בשו?"
  },
  {
    "Hebrew": "איזו שעה של היום את/ה מעדיף/ה ולמה?",
    "Arabic": "اي ساعة باليوم انت بتفضل \\ بتفضلي وليش؟",
    "Taatik": "אי סאעה באליום אנת בתפצ'ל \\ בתפצ'לי וליש?"
  },
  {
    "Hebrew": "על איזו תקופה בחייך היית חוזר/ת ולמה?",
    "Arabic": "على اي فترة بحياتك كنت بترجع\\ بترجعي وليش؟",
    "Taatik": "עלא אי פתרה בחיאתכ כנת בתרג'ע\\ בתרג'עי וליש?"
  },
  {
    "Hebrew": "מהו המשחק שהכי אהבת בילדותך?",
    "Arabic": "اكتر لعبة حبيتها بطفولتك؟",
    "Taatik": "אכתר לעבה חביתהא בטפולתכ?"
  },
  {
    "Hebrew": "מיהי הדמות שהשפיעה עליך ביותר וכיצד?",
    "Arabic": "شو اكتر شخصية أثرت فيك وكيف؟",
    "Taatik": "שו אכתר שח'ציה את'רת פיכ וכיפ?"
  },
  {
    "Hebrew": "מהם שלושת הדברים שהיית לוקח/ת איתך לאי בודד?",
    "Arabic": "شو الثلاثة اشياء الي بتوخدها \\ بتوخديها معك لجزيرة نائية؟",
    "Taatik": "שו אלת'לאת'ה אשיאא אלי בתוח'דהא \\ בתוח'דיהא מעכ לג'זירה נאאיה?"
  },
  {
    "Hebrew": "לו היית יכול/ה להתעורר מחר בבוקר בגופו של אדם אחר, האם היית עושה זאת? ובמי היית בוחר/ת? (רק הגוף משתנה)",
    "Arabic": "اذا كان فيك \\فيكي تصحي بكرا الصبح بجسم بني ادم ثاني , هل كنت بتعملو \\ بتعمليه ؟ وبمين كنت بتختار\\ بتختاري ؟ ( فقط الجسم بتغير)",
    "Taatik": "אד'א כאן פיכ \\פיכי תצחי בכרא אלצבח בג'סם בני אדם ת'אני , הל כנת בתעמלו \\ בתעמליה ? ובמין כנת בתח'תאר\\ בתח'תארי ? ( פקט אלג'סם בתע'יר)"
  },
  {
    "Hebrew": "מה הייתה העבודה הראשונה בחייך? ובאיזה גיל זה היה?",
    "Arabic": "شو اول شغل كان الك بحياتك ؟ وبأي جيل كان؟",
    "Taatik": "שו אול שע'ל כאן אלכ בחיאתכ ? ובאי ג'יל כאנ?"
  },
  {
    "Hebrew": "מהו הדבר הראשון שאת/ה עושה בבוקר? ומהי המחשבה הראשונה שעולה לך בבוקר ממוצע?",
    "Arabic": "ايش الاشي الاول الي بتعملو او ( الي بتسويه ) في صبح ؟ وشو اول فكرة بتيجي او ( بتخطر) على بالك؟",
    "Taatik": "איש אלאשי אלאול אלי בתעמלו או ( אלי בתסויה ) פי צבח ? ושו אול פכרה בתיג'י או ( בתח'טר) עלא באלכ?"
  },
  {
    "Hebrew": "מה הדבר הכי חשוב שקרה לך בשנה האחרונה?",
    "Arabic": "شو اكتر اشي مهم صار معك بالسنة الاخيرة؟",
    "Taatik": "שו אכתר אשי מהם צאר מעכ באלסנה אלאח'ירה?"
  },
  {
    "Hebrew": "אם היית חייב להחליף שם, איזה שם היית בוחר לעצמך?",
    "Arabic": "اذا كنت لازم تتغير الاسم تبعتك , اي اسم تخود؟",
    "Taatik": "אד'א כנת לאזם תתע'יר אלאסם תבעתכ , אי אסם תח'וד?"
  },
  {
    "Hebrew": "מהו הדבר המטורף/ משוגע/ הזוי/ חריג/ משונה שעשית בחייך?",
    "Arabic": "شو الاشي المجنون/ خاص/ غريب؟ اللي عملتو بحياتك؟",
    "Taatik": "שו אלאשי אלמג'נונ/ ח'אצ/ ע'ריב? אללי עמלתו בחיאתכ?"
  },
  {
    "Hebrew": "אם היית מקבל/ת מחר 3 משאלות - מה היית בוחר?",
    "Arabic": "اذا بحكولك انو بحققولك تلات امنيات، شو كنت بتختار؟",
    "Taatik": "אד'א בחכולכ אנו בחקקולכ תלאת אמניאת، שו כנת בתח'תאר?"
  },
  {
    "Hebrew": "מה היית רוצה לשנות בעולם?",
    "Arabic": "شو كنت بدك تغيّر بالعالم؟",
    "Taatik": "שו כנת בדכ תע'יר באלעאלמ?"
  },
  {
    "Hebrew": "מהן התכונות הכי טובות שלך?",
    "Arabic": "شو احسن صفات عندك؟",
    "Taatik": "שו אחסן צפאת ענדכ?"
  },
  {
    "Hebrew": "איזה שפות את/ה מדבר/ת?",
    "Arabic": "اي لغات انت بتحكي؟",
    "Taatik": "אי לע'את אנת בתחכי?"
  },
  {
    "Hebrew": "מהם שלושת הדברים שאת/ה אף פעם לא יוצאת מהבית בלעדיהם?",
    "Arabic": "شو ثلاث اشيا اللي ولا مرة بتطلع من البيت بدونهن ؟",
    "Taatik": "שו ת'לאת' אשיא אללי ולא מרה בתטלע מן אלבית בדונהן ?"
  },
  {
    "Hebrew": "מהו השיר האהוב עליך?",
    "Arabic": "شو الاغنية المفضلة عندك؟",
    "Taatik": "שו אלאע'ניה אלמפצ'לה ענדכ?"
  },
  {
    "Hebrew": "מהו החג האהוב עליך?",
    "Arabic": "شو العيد المفضل عندك؟",
    "Taatik": "שו אלעיד אלמפצ'ל ענדכ?"
  },
  {
    "Hebrew": "מי הבן אדם שהכי מצחיק אותך?",
    "Arabic": "مين اكثر انسان بضحكك؟",
    "Taatik": "מין אכת'ר אנסאן בצ'חככ?"
  },
  {
    "Hebrew": "איפה המקום שאת/ה הכי אוהב/ת לבלות בו?",
    "Arabic": "شو اكثر محل بتحب تقضي وقت في؟",
    "Taatik": "שו אכת'ר מחל בתחב תקצ'י וקת פי?"
  },
  {
    "Hebrew": "מהי העונה האהובה עליך? למה?",
    "Arabic": "شو الفصل المفضل عندك؟ وليش؟",
    "Taatik": "שו אלפצל אלמפצ'ל ענדכ? וליש?"
  },
  {
    "Hebrew": "אם היית יכול לשנות טעות מן העבר שלך, מה היא הייתה?",
    "Arabic": "اذا كنت بدك تغير غلطة من الماضي، شو كانت بتكون؟",
    "Taatik": "אד'א כנת בדכ תע'יר ע'לטה מן אלמאצ'י, שו כאנת בתכונ?"
  },
  {
    "Hebrew": "האם את/ה נוטה לראות במצבים שונים בחיים את חצי הכוס הריקה או המלאה?",
    "Arabic": "شو انت بتميل انك تشوف بمواقف مختلفة بالحياة، نص الكاسة الفاضي او المليانة؟",
    "Taatik": "שו אנת בתמיל אנכ תשוף במואקף מח'תלפה באלחיאה, נצ אלכאסה אלפאצ'י או אלמליאנה?"
  },
  {
    "Hebrew": "את/ה נוהג למקום חדש שאת/ה לא מכיר/ה והולך/ת לאיבוד. מה את/ה עושה?",
    "Arabic": "اذا كنت عم تسوق لمحل جديد اللي ما بتعرفو وضعت، شو بتعمل؟",
    "Taatik": "אד'א כנת עם תסוק למחל ג'דיד אללי מא בתערפו וצ'עת, שו בתעמל?"
  },
  {
    "Hebrew": "ספר על אירוע מעניין שקרה לך פעם?",
    "Arabic": "احكي عن حدث مثير للاهتمام اللي صار معك مرة؟",
    "Taatik": "אחכי ען חדת' מת'יר ללאהתמאם אללי צאר מעכ מרה?"
  },
  {
    "Hebrew": "ספר על זיכרון מעניין או מיוחד שבטח תספר/י עליו לנכדים שלך",
    "Arabic": "احكي عن ذكرى مثير للاهتمام او خاص الي رح تخرفو\\ نخرفيه للاحفادك",
    "Taatik": "אחכי ען ד'כרא מת'יר ללאהתמאם או ח'אצ אלי רח תח'רפו\\ נח'רפיה ללאחפאדכ"
  },
  {
    "Hebrew": "מהו הזיכרון הכי מצחיק שלך ?",
    "Arabic": "اكتر مقطع مضحك لالك ؟",
    "Taatik": "אכתר מקטע מצ'חכ לאלכ ?"
  },
  {
    "Hebrew": "מה הדבר הראשון שעובר לך בראש כשאתה חושב/ת על העתיד ?",
    "Arabic": "شو اول شي بخطر على بالك ببس تفكر\\ تفكري بالمستقبل ؟",
    "Taatik": "שו אול שי בח'טר עלא באלכ בבס תפכר\\ תפכרי באלמסתקבל ?"
  },
  {
    "Hebrew": "אם היית יכול/ה לקבל תכונה אחת לעצמך מה היית מבקש/ת ?",
    "Arabic": "اذا كان فيك \\ فيكي توخدي صفة (تحصلي على صفة ) لنفسك شو كنت بتطلب \\ بتطلبي ؟",
    "Taatik": "אד'א כאן פיכ \\ פיכי תוח'די צפה (תחצלי עלא צפה ) לנפסכ שו כנת בתטלב \\ בתטלבי ?"
  },
  {
    "Hebrew": "מהו הדבר שלמדת, אשר ילווה אותך לאורך כל החיים ?",
    "Arabic": "شو الاشي اللي تعلمتو ورح يرافقك بكل حياتك؟",
    "Taatik": "שו אלאשי אללי תעלמתו ורח יראפקכ בכל חיאתכ?"
  },
  {
    "Hebrew": "מהו המשפט שאמרו לך ושנחרט לך בזיכרון ?",
    "Arabic": "شو جملة حكولك اياها وانخرطت بذاكرتك؟",
    "Taatik": "שו ג'מלה חכולכ איאהא ואנח'רטת בד'אכרתכ?"
  },
  {
    "Hebrew": "מה מכעיס אותך ומדוע ?",
    "Arabic": "شو الي بعصبك ؟ وليش ؟",
    "Taatik": "שו אלי בעצבכ ? וליש ?"
  },
  {
    "Hebrew": "מהו הדבר שהכי משמח אותך, או מרגש אותך ?",
    "Arabic": "شو اكتر شي بفرحك او بحرك مشاعرك ؟",
    "Taatik": "שו אכתר שי בפרחכ או בחרכ משאערכ ?"
  },
  {
    "Hebrew": "איך את/ה מפנק/ת את עצמך ?",
    "Arabic": "كيف بدلل \\ بدللي حالك ؟",
    "Taatik": "כיף בדלל \\ בדללי חאלכ ?"
  },
  {
    "Hebrew": "האם יש לך מוטו/משפט לחיים?",
    "Arabic": "في عندك حكمة أو جملة بتمشي حسبها في الحياة؟",
    "Taatik": "פי ענדכ  חכמה או ג'מלה בתמשי חסבהא פי אלחיאה?"
  },
  {
    "Hebrew": "מה מפחיד אותך?",
    "Arabic": "شو الي بخفوك ؟",
    "Taatik": "שו אלי בח'פוכ ?"
  },
  {
    "Hebrew": "באילו אמונות טפלות אתה\\את מאמין\\ה?",
    "Arabic": "باي خرافات انت بتآمن \\ بتأمني ؟",
    "Taatik": "באי ח'ראפאת אנת בתאאמן \\ בתאמני ?"
  },
  {
    "Hebrew": "איזה חלום חלמת בעבר והיית רוצה לשוב ולחלום אותו?",
    "Arabic": "اي حلم حلمتو\\ حلمتيه بالماضي وبدك تحلمو \\ تحلميه كمان مرة ؟",
    "Taatik": "אי חלם חלמתו\\ חלמתיה  באלמאצ'י  ובדכ תחלמו \\ תחלמיה כמאן מרה ?"
  },
  {
    "Hebrew": "על מה בחייך את/ה אסיר/ת תודה ביותר?",
    "Arabic": "اكتر شي انت ممتنه الو ( ممتنه له ) بيحاتك ؟",
    "Taatik": "אכתר שי אנת ממתנה אלו ( ממתנה לה ) ביחאתכ ?"
  },
  {
    "Hebrew": "מהו המאכל שלעולם לא תסכים/י לטעום?",
    "Arabic": "شو الاكلة الي مش ممكن تذوقو\\ تذوقيه بحياتك ؟",
    "Taatik": "שו אלאכלה אלי מש ממכן תד'וקו\\ תד'וקיה בחיאתכ ?"
  },
  {
    "Hebrew": "איזה חפץ את/ה שומר/ת וכנראה שתשמור/י לעולם?",
    "Arabic": "اي غرض كنت بتحتفظ فيه \\ بتحتفظي فيه للابد ؟",
    "Taatik": "אי ע'רצ' כנת בתחתפט' פיה \\ בתחתפט'י פיה ללאבד ?"
  },
  {
    "Hebrew": "אם יכלת לחזור בזמן ולשנות משהו, לאיזה זמן היית חוזר ומה היית משנה?",
    "Arabic": "اذا كان فيك ترجع بالزمن وتغير اشي , لاي فترة بترجع ؟ وشو كنت بتغير؟",
    "Taatik": "אד'א כאן פיכ תרג'ע באלזמן ותע'יר אשי , לאי פתרה בתרג'ע ? ושו כנת בתע'יר?"
  },
  {
    "Hebrew": "ספר על חוויה משמעותית שעברת בחייך ?",
    "Arabic": "احكي عن تجربة مهمة مرقتها بحياتك؟",
    "Taatik": "אחכי ען תג'רבה מהמה מרקתהא בחיאתכ?"
  }
]
const data = JSON.parse(JSON.stringify(dataJson))