var past = [];
function getItem(){
    if (past.length == hebrew.length) {
        past = [];
    }
    while (true) {
        var i = Math.floor(Math.random() * hebrew.length);
        var found = false;
        for (j = 0; j < past.length; j++) {
            if (i == past[j]) {
                found = true;
                break;
            }
        }
        if (!found) {
            break
        }
    }
    past.push(i);
    document.getElementById("hebrewText").innerHTML = hebrew[i];
	document.getElementById("arabicText").innerHTML = arabic[i];
}

var hebrew = [
"?מה הספר האחרון שקראת",
"?אם היית יכול/ה לעבוד בכל מקצוע, באיזה מקצוע זה היה",
"?אם היית יכול לתת לילד עצה אחת לחיים- מה היית אומר",
"?כלבים או חתולים",
"?מהם שמות החיבה שלך",
"?מה הדבר שתמיד רצית לעשות אבל עדיין לא הספקת",
"?אם היו אומרים לך שנותרו לך רק כמה חודשים לחיות. מה היית עושה",
"?אם היית יכול/ה להיות כל חיה, מה היית ולמה",
"?אם היה לך מיליון דולר, מה היית עושה",
"ספר משהו שאנשים לא יודעים עליך",
"?אם היית יכול/ה לפגוש אישיות מפורסמת, מי זה היה? על מה היית מדבר איתו",
"?הבית שלך עולה באש. מה הדבר הראשון שאת/ה מציל/ה",
"?אם היית יכול/ה להגיע לכל מקום בעולם, לאן היית הולך/ת",
"?איפה את/ה רואה את עצמך 10 שנים מהיום",
"?מה הדבר שהכי היית רוצה לעשות ולמה",
"?מהו הדבר שאתה הכי מעריך/ה אצל אנשים/ חברים",
"?מה היית רוצה ללמוד ולמה",
"?מהו הדבר המטורף/ משוגע/ הזוי/ חריג/ משונה שעשית בחייך",
"?אם היית מקבל/ת מחר 3 משאלות - מה היית בוחר"
];

var arabic = [
"شو اخر كتاب قرأته؟",
"اذا كنت بتقدر تشتغل بكل موضوع بأي موضوع كنت بتشتغل؟",
"اذا كنت بدك تعطي لولد نصيحة واحدة للحياة شو كنت بتقوله؟",
"بساس ولا كلاب؟",
"شو القابك؟",
"شو الاشي اللي دايما بدك تعملو بس بعدك مش عاملو؟",
"اذا حكولك انو ضل بس كم شهر تعيش، شو كنت بتعمل؟",
"اذا كنت بتقدر تكون كل حيوان، شو كنت بتكون؟",
"اذا كان معك مليون دولار شو كنت بتعمل؟",
"احكي اشي الناس ما بتعرفوا عنك",
"اذا كنت بتقدر تقابل شخصية مشهورة مين كنت بتنقي؟ وعن شو بتحكي معو؟",
"اذا بيتك عم يحترق، شو اول شي بتنقذو؟",
"اذا فيك\ فيكي توصلي لكل مكان بالعالم ؟ لوين كنت بتروح \ بتروحي ؟",
"وين بتشوف\ بتشوفي حالك بعد 10 سنين من اليوم ؟",
"شو اكتر شي كنت بدك تعلمو\ تعمليه وليش؟",
"شو اكثر اشي بتقدرو عند ناس/صحاب؟",
"شو كنت بتحب تتعلم وليش؟",
"شو الاشي المجنون/ خاص/ غريب? اللي عملتو بحياتك؟",
"اذا بحكولك انو بحققولك تلات امنيات، شو كنت بتختار؟"
];