const arabicSongsJson = {
  "1": {
    "HebrewLyrics": "אני בא איפה את | באלהים אני בא איפה את | רק תגידי מה יש לך | רק תגידי מה יש לך | | הסלולרי שלי כבה | ואני שכחתי את עצמי | את מתקשרת ומנסה | ואני הלך לי מהראש | ברא שלך יא אמאני (שם של בחורה) | הלכתי ובאתי (אוכלת סרטים) | מה קרה לך שאת דואגת כל כך | כל זה בגללי | | אני בא איפה את | באלהים אני בא איפה את | רק תגידי מה יש לך | רק תגידי מה יש לך | | שערי הלבין | ואני עסוק | בין עבודתי להופעות | אין לי זמן לחיי | זמני במקומות אחרים | אני כותב לך שירים | אף אחד לא בא אצלי | בגללך יא אמאני | | אני בא איפה את | באלהים אני בא איפה את | רק תגידי מה יש לך | רק תגידי מה יש לך |",
    "ArabicLyrics": "باجي وينك | والله باجي وينك | بس قولي شو مالك | بس قولي شو مالك | | انفصل جوّالي | وأنا ناسي حالي | بترنّي وبتحاولي | وأنا رايح عن بالي | عقلك يا أماني | اخدني وودّاني | شو قصتك حردانة | كل هاد عشاني | | باجي وينك | والله باجي وينك | بس قولي شو مالك | بس قولي شو مالك | | شابو شعراتي | وأنا حالي حالتي | بين شغلي وسهراتي | مش رايق لحياتي | وقتي محل تاني | بكتبلك غناني | ما حد أجاني | عشانك يا أماني | | باجي وينك | والله باجي وينك | بس قولي شو مالك | بس قولي شو مالك |",
    "TaatikLyrics": "בּאג'י וינכ | ואללה בּאג'י וינכ | בּס קולי שו מאלכ | בּס קולי שו מאלכ | | אנפֿס׳ל ג'וّאלי | וא׳נא נאסי חאלי | בּתרנّי ובּתחאולי | וא׳נא ראיח ענ בּאלי | עקלכ יא א׳מאני | אח׳דני וודّאני | שו קס׳תכ חרדאנה | כל האד עשאני | | בּאג'י וינכ | ואללה בּאג'י וינכ | בּס קולי שו מאלכ | בּס קולי שו מאלכ | | שאבּו שעראתי | וא׳נא חאלי חאלתי | בּינ שע׳לי וסהראתי | מש ראיק לחיאתי | וקתי מחל תאני | בּכתבּלכ ע׳נאני | מא חד א׳ג'אני | עשאנכ יא א׳מאני | | בּאג'י וינכ | ואללה בּאג'י וינכ | בּס קולי שו מאלכ | בּס קולי שו מאלכ |",
    "HebrewTitle": "אני בא איפה את",
    "ArabicTitle": "Apo & the Apostles - باجي وينك",
    "TaatikTitle": "בּאג'י וינכ",
    "Link": "https://www.youtube.com/watch?v=dwS0q-k1bPY"
  },
  "2": {
    "HebrewLyrics": "",
    "ArabicLyrics": "انت معلم | واحنا منك نتعلم | | نسكت وانت موجود | ما نرضى نتكلم | | وللي خلاك ميفهم | يجي لو يوم ويندم | و ما تسمع للي يخدعك | انت معلم | | نظرة بالإشارة | تعرف نبض الحرارة | | انت في الحب عبارة | تخلي العقول حيارة | | تستاهل طيارة | لا طيارة شوية عليك | | تطير انت في العالي | ما نوصلك يا غالي",
    "TaatikLyrics": "אנת מעלם | ואחנא מנכ נתעלם | | נסכת ואנת מוג'וד | מא נרצ'א נתכלם | | וללי ח'לאכ מיפהם | יג'י לו יום וינדם | ו מא תסמע ללי יח'דעכ | אנת מעלם | | נט'רה באלאשארה | תערף נבצ' אלחרארה | | אנת פי אלחב עבארה | תח'לי אלעקול חיארה | | תסתאהל טיארה | לא טיארה שויה עליכ | | תטיר אנת פי אלעאלי | מא נוצלכ יא ע'אלי",
    "HebrewTitle": "",
    "ArabicTitle": "سعد لمجرد - لمعلم",
    "TaatikTitle": "סעד למג'רד - למעלמ",
    "Link": "https://www.youtube.com/watch?v=_Fwf45pIAtM"
  },
  "3": {
    "HebrewLyrics": "",
    "ArabicLyrics": "كلمة حلوة وكلمتين حلوة يا بلدي | غنوة حلوة وغنوتين حلوة يا بلدي | املي دايما كان يا بلدي | اني ارجعلك يا بلدي | وافضل دايما جنبك علي طول | زكريات كل الي فات فاكرة يا بلدي | قلبي مليان بحكيات | فاكرة يابلدي اول حب كان في بلدي | مش ممكن انسا يابلدي | فين ايام زمان قبل الودااع | | كنا بنقول ان الفراق دة مستحيل | وكل دمعة علي الخدين كانت بتسيل | مليانة بامل ان احنا نبقا موجدين في بحر الحب علي الشطين | فين حبيب القلب يا بلدي | كان بعيد عني يابلدي | وكل ما بغني بفاكر فية | | قول يا حبيبي انت سايبني ورايح فين | اجمل لحن دة هنغنية احنا الاتنين | يا محلي كامة بلدي في غنوة بين سطرين | ياليل يا عين يا عين يالي",
    "TaatikLyrics": "כלמה חלוה וכלמתין חלוה יא בלדי | ע'נוה חלוה וע'נותין חלוה יא בלדי | אמלי דאימא כאן יא בלדי | אני ארג'עלכ יא בלדי | ואפצ'ל דאימא ג'נבכ עלי טול | זכריאת כל אלי פאת פאכרה יא בלדי | קלבי מליאן בחכיאת | פאכרה יאבלדי אול חב כאן פי בלדי | מש ממכן אנסא יאבלדי | פין איאם זמאן קבל אלודאאע | | כנא בנקול אן אלפראק דה מסתחיל | וכל דמעה עלי אלח'דין כאנת בתסיל | מליאנה באמל אן אחנא נבקא מוג'דין פי בחר אלחב עלי אלשטין | פין חביב אלקלב יא בלדי | כאן בעיד עני יאבלדי | וכל מא בע'ני בפאכר פיה | | קול יא חביבי אנת סאיבני וראיח פין | אג'מל לחן דה הנע'ניה אחנא אלאתנין | יא מחלי כאמה בלדי פי ע'נוה בין סטרין | יאליל יא עין יא עין יאלי",
    "HebrewTitle": "",
    "ArabicTitle": "دالـيــدا - حـلـوة يـا بـلـدي",
    "TaatikTitle": "דאלידא - חלוה יא בלדי",
    "Link": "https://www.youtube.com/watch?v=N4b1K9GBLQ4"
  },
  "4": {
    "HebrewLyrics": "",
    "ArabicLyrics": "تملي معاك ولو حتى بعيد عني في قلبي هواك | تملي معاك تملي في بالي وفي قلبي ولا بنساك | تملي واحشني لو حتى بكون وياك | | تملي حبيبي بشتاقلك تملي عنيا تندهلك | ولو حواليا كل الكون بكون يا حبيبي محتاجلك | | تملي معاك معاك قلبي معاك روحي يا أغلى حبيب | يا أغلى حبيب ومهما تكون بعيد عني لقلبي قريب | يا عمرى الجاي والحاضر يا احلى نصيب | تملي معاك معاك قلبي معاك عمري يا اغلى حبيب | يا اغلى حبيب ومهما تكون بعيد عني لقلبى قريب | يا عمرى الجاي والحاضر يا احلى نصيب | | تملي حبيبي بشتاقلك تملي عنيا تندهلك | ولو حواليا كل الكون بكون يا حبيبي محتاجلك",
    "TaatikLyrics": "תמלי מעאכ ולו חתא בעיד עני פי קלבי הואכ | תמלי מעאכ תמלי פי באלי ופי קלבי ולא בנסאכ | תמלי ואחשני לו חתא בכון ויאכ | | תמלי חביבי בשתאקלכ תמלי עניא תנדהלכ | ולו חואליא כל אלכון בכון יא חביבי מחתאג'לכ | | תמלי מעאכ מעאכ קלבי מעאכ רוחי יא אע'לא חביב | יא אע'לא חביב ומהמא תכון בעיד עני לקלבי קריב | יא עמרא אלג'אי ואלחאצ'ר יא אחלא נציב | תמלי מעאכ מעאכ קלבי מעאכ עמרי יא אע'לא חביב | יא אע'לא חביב ומהמא תכון בעיד עני לקלבא קריב | יא עמרא אלג'אי ואלחאצ'ר יא אחלא נציב | | תמלי חביבי בשתאקלכ תמלי עניא תנדהלכ | ולו חואליא כל אלכון בכון יא חביבי מחתאג'לכ",
    "HebrewTitle": "",
    "ArabicTitle": "عمرو دياب - تملي معاك",
    "TaatikTitle": "עמרו דיאב - תמלי מעאכ",
    "Link": "https://www.youtube.com/watch?v=EgmXTmj62ic"
  },
  "5": {
    "HebrewLyrics": "",
    "ArabicLyrics": "ياريت, يا ريت يا ويا ريت | اكتبلك قديش حبيتك, | بلا جدار لاني | عم بشكي من حيط وبنبني حيط بيني وبينك. | ياريت، يا ريت.. يا ريت اكتبلك قديش حبيتك.. | ياريت, يا ريت .. ويا ريت.. | | اكتبلك أغنية حب ملانة \"كليشيهات\" - ببدع فكل اشي واشي، وبَبلّم بالاشي هاد! | بدي اتخيل.. | بوسة بالمطر, بطن بترجف..بس بكره المطر! | \"تراوما\"! | سقف بدلف! | بحط طناجر في كل القُرن, | المي في كل الغرف وصلتلي \"فُل\" للركب! | بدي أصُد النقط! | بحط اغنية الحب بالجارور.. | بتعاود تعود، بعد ما افك كل العُقد.. | فـ صفيت مبلول ع عتبتك.. | إطلعيني من الشارع، دخلك! | غطيني في ملابسك.. | خايف أبيّن عريان وضعيف أنا جنبك.. | اطردي مني جن الفقر اطردي مني جن القهر.. | اطردي مني الشعور انه فش بكرا.. | اطردي مني جن السم.. | اطردي مني دين البنك.. | احضنيني اكنه فش بكرا..! | | محمود درويش كتب منصير شعب: | \"لما الشاعر يكتب وصف إباحي لبطن الراقصة\" | الله يرحمك.. | كنت بزودها! | منصير شعب: | \"لما بطن الراقص ينوصف في اباحية ع إيدين شاعرة\"! | فبكتُب..! | ضد الشرف اللي كتبوا الذكور | ضد حصار غزة. | ضد اللي قطعوا النور.. | بكتب للمخيم ضد الريس بالقصور | وحاليًا.. | اغنية الحب لاجئة بالجارور! | وانا لـَ عتبتك لاجئ.. ذكريني! | الظلم مش حاجة بل حاجز! | نزليلي ملابسي بلمسك، مستعد أبين عريان وضعيف انا جنبك! | حطي فيّ جن العاشقة.. | حطي فيّ جن الثائرة.. | اللي بتطالب بالارض وفي شفافي! | حطي فيي جن الناضجة.. | حطي فيي جن الواثقة.. | ما اخاف عليكي ولا اخافك. | | لنذهب كما نحن, عاشقة ً حرةً | وشاعرها.. | لنذهب معا في طريقين مختلفين.. | لنذهب كما نحن متحدين ومنفصلين .. | لنذهب معا.. | ولنكن طيبين.",
    "TaatikLyrics": "יארית, יא רית יא ויא רית | אכתבלכ קדיש חביתכ, | בלא ג'דאר לאני | עם בשכי מן חיט ובנבני חיט ביני ובינכ. | יארית, יא רית.. יא רית אכתבלכ קדיש חביתכ.. | יארית, יא רית .. ויא רית.. | | אכתבלכ אע'ניה חב מלאנה \"כלישיהאת\" - בבדע פכל אשי ואשי, ובבלם באלאשי האד! | בדי אתח'יל.. | בוסה באלמטר, בטן בתרג'ף..בס בכרה אלמטר! | \"תראומא\"! | סקף בדלפ! | בחט טנאג'ר פי כל אלקרן, | אלמי פי כל אלע'רף וצלתלי \"פל\" ללרכב! | בדי אצד אלנקט! | בחט אע'ניה אלחב באלג'ארור.. | בתעאוד תעוד, בעד מא אפכ כל אלעקד.. | פـ צפית מבלול ע עתבתכ.. | אטלעיני מן אלשארע, דח'לכ! | ע'טיני פי מלאבסכ.. | ח'איף אבין עריאן וצ'עיף אנא ג'נבכ.. | אטרדי מני ג'ן אלפקר אטרדי מני ג'ן אלקהר.. | אטרדי מני אלשעור אנה פש בכרא.. | אטרדי מני ג'ן אלסם.. | אטרדי מני דין אלבנכ.. | אחצ'ניני אכנה פש בכרא..! | | מחמוד דרויש כתב מנציר שעב: | \"למא אלשאער יכתב וצף אבאחי לבטן אלראקצה\" | אללה ירחמכ.. | כנת בזודהא! | מנציר שעב: | \"למא בטן אלראקצ ינוצף פי אבאחיה ע אידין שאערה\"! | פבכתב..! | צ'ד אלשרף אללי כתבוא אלד'כור | צ'ד חצאר ע'זה. | צ'ד אללי קטעוא אלנור.. | בכתב ללמח'ים צ'ד אלריס באלקצור | וחאליא.. | אע'ניה אלחב לאג'אה באלג'ארור! | ואנא לـ עתבתכ לאג'א.. ד'כריני! | אלט'לם מש חאג'ה בל חאג'ז! | נזלילי מלאבסי בלמסכ, מסתעד אבין עריאן וצ'עיף אנא ג'נבכ! | חטי פי ג'ן אלעאשקה.. | חטי פי ג'ן אלת'אארה.. | אללי בתטאלב באלארצ' ופי שפאפי! | חטי פיי ג'ן אלנאצ'ג'ה.. | חטי פיי ג'ן אלואת'קה.. | מא אח'אף עליכי ולא אח'אפכ. | | לנד'הב כמא נחן, עאשקה  חרה | ושאערהא.. | לנד'הב מעא פי טריקין מח'תלפין.. | לנד'הב כמא נחן מתחדין ומנפצלין .. | לנד'הב מעא.. | ולנכן טיבין.",
    "HebrewTitle": "",
    "ArabicTitle": "تامر نفار - يا ريت (مفرق 48)",
    "TaatikTitle": "תאמר נפאר - יא רית (מפרק 48)",
    "Link": "https://www.youtube.com/watch?v=wuG0n-fVTBw"
  },
  "6": {
    "HebrewLyrics": "",
    "ArabicLyrics": "ولك خف علينا شوي | خليني أحطك بين عيني | ياباي ياباي ياباي ياباي ياباي | | وأنا حاسس حالي زي | كأني مربط من إيدي | ياباي ياباي ياباي ياباي ياباي | | زي ما بدأ هالحب اليوم بنهيه | وآخر المنام حسيت و هيني صحيت | | الركض تعب رجلي | والسهر ياباي عيني | ياباي ياباي | | ودتنا عالبحر وهينا رجعنا | | ياباي ياباي | | ولا طلع بإيدي نقطة ماي | | ياباي ياباي | | رمتنا بالسما وهينا وقعنا قال هدا حب؟ | قال هيك تحس حالك حي | | ياباي ولك خف علينا شوي | خليني أحطك بين عيني | | ياباي ياباي ياباي ياباي ياباي | | وأنا حاسس حالي زي | كأني مربط من إيدي | | ياباي ياباي ياباي ياباي ياباي | | ول شو طال هالدرب وعم بمشيه أحزاني | إدماني ليه اتمسك فيه؟ | أنا صرت قدام الناس | قصة شارب من غير كاس | | ياباي ياباي | | ودتنا عالبحر وهينا رجعنا | | ياباي ياباي | | ولا طلع بإيدي نقطة ماي | | ياباي ياباي | | رمتنا بالسما وهينا وقعنا هدا حب؟ | قال هيك تحس حالك حي | | يااابااااي | | ولك خف علينا شوي | خليني أحطك بين عيني | | ياباي ياباي ياباي ياباي ياباي | | وأنا حاسس حالي زي | كأني مربط من إيدي | | ياباي ياباي ياباي ياباي ياباي | | من وين ما إجى هالحب | بوديه لآخر مكان بعيد ولا بعديه | لأنه أنا اليوم اتمنيت | أنا وإنت نعيش ببيت | | ياباي ياباي | | ودتنا عالبحر وهينا رجعنا | | ياباي ياباي | | ولا طلع بإيدي نقطة ماي | | ياباي ياباي | | رمتنا بالسما وهينا وقعنا هدا حب؟ | قال هيك تحس حالك حي | | يااابااااي | | ولك خف علينا شوي | خليني أحطك بين عيني | | ياباي ياباي ياباي ياباي ياباي | | وأنا حاسس حالي زي | كأني مربط من إيدي | | ياباي ياباي ياباي ياباي ياباي | | ولك خف علينا شوي | | وأنا حاسس حالي زي | | ولك خف علينا شوي | خليني أحطك بين عيني |",
    "TaatikLyrics": "ולכ ח'ף עלינא שוי | ח'ליני אחטכ בין עיני | יאבאי יאבאי יאבאי יאבאי יאבאי | | ואנא חאסס חאלי זי | כאני מרבט מן אידי | יאבאי יאבאי יאבאי יאבאי יאבאי | | זי מא בדא האלחב אליום בנהיה | ואאח'ר אלמנאם חסית ו היני צחית | | אלרכצ' תעב רג'לי | ואלסהר יאבאי עיני | יאבאי יאבאי | | ודתנא עאלבחר והינא רג'ענא | | יאבאי יאבאי | | ולא טלע באידי נקטה מאי | | יאבאי יאבאי | | רמתנא באלסמא והינא וקענא קאל הדא חב? | קאל היכ תחס חאלכ חי | | יאבאי ולכ ח'ף עלינא שוי | ח'ליני אחטכ בין עיני | | יאבאי יאבאי יאבאי יאבאי יאבאי | | ואנא חאסס חאלי זי | כאני מרבט מן אידי | | יאבאי יאבאי יאבאי יאבאי יאבאי | | ול שו טאל האלדרב ועם במשיה אחזאני | אדמאני ליה אתמסכ פיה? | אנא צרת קדאם אלנאס | קצה שארב מן ע'יר כאס | | יאבאי יאבאי | | ודתנא עאלבחר והינא רג'ענא | | יאבאי יאבאי | | ולא טלע באידי נקטה מאי | | יאבאי יאבאי | | רמתנא באלסמא והינא וקענא הדא חב? | קאל היכ תחס חאלכ חי | | יאאאבאאאאי | | ולכ ח'ף עלינא שוי | ח'ליני אחטכ בין עיני | | יאבאי יאבאי יאבאי יאבאי יאבאי | | ואנא חאסס חאלי זי | כאני מרבט מן אידי | | יאבאי יאבאי יאבאי יאבאי יאבאי | | מן וין מא אג'א האלחב | בודיה לאאח'ר מכאן בעיד ולא בעדיה | לאנה אנא אליום אתמנית | אנא ואנת נעיש בבית | | יאבאי יאבאי | | ודתנא עאלבחר והינא רג'ענא | | יאבאי יאבאי | | ולא טלע באידי נקטה מאי | | יאבאי יאבאי | | רמתנא באלסמא והינא וקענא הדא חב? | קאל היכ תחס חאלכ חי | | יאאאבאאאאי | | ולכ ח'ף עלינא שוי | ח'ליני אחטכ בין עיני | | יאבאי יאבאי יאבאי יאבאי יאבאי | | ואנא חאסס חאלי זי | כאני מרבט מן אידי | | יאבאי יאבאי יאבאי יאבאי יאבאי | | ולכ ח'ף עלינא שוי | | ואנא חאסס חאלי זי | | ולכ ח'ף עלינא שוי | ח'ליני אחטכ בין עיני |",
    "HebrewTitle": "",
    "ArabicTitle": "عزيز مرقة - يا باي",
    "TaatikTitle": "עזיז מרקה - יא באי",
    "Link": "https://www.youtube.com/watch?v=YCc6My7Vo-A"
  },
  "7": {
    "HebrewLyrics": "",
    "ArabicLyrics": "ما خيّرتيني , صفنت أنا فيكي , تغيّرتي ليه؟ | بشوارعك دفنتيني , ما دام صوتي صار صدى في مجاريها , ما صرّحتي ليه ؟ | | تخبّي نامي في مكانك , بقولوا منك الليل غيران | ضلّي أنت العنوان , لإنه في بعدك ما إلناش جيران | | إحنا الحكايا الجداد | احنا الهدايا الجداد | | احنا الحكايا الي ...مش كل شيء بيرضيكي بيرضينا | إنت تغيّرتي ليه .. ضل شوقي أنا شلال , بيجري بحواريكي | | طلّي برا شبّاكك , بربك قوليلي إحنا كيف ننام ؟ | ما ضلّش إشي الي ينهان , عودي و لاقينا لإنه الطريق توهان | | إحنا الحكايا الجداد | احنا الهدايا الجداد | | احنا الحكايا الي ...مش كل شيء بيرضيكي بيرضينا | إنت تغيّرتي ليه .. ضل شوقي أنا شلال , بيجري بحواريكي | | إحنا الحكايا الجداد | احنا الهدايا الجداد | | احنا الحكايا الي ...مش كل شيء بيرضيكي بيرضينا",
    "TaatikLyrics": "מא ח'ירתיני , צפנת אנא פיכי , תע'ירתי ליה? | בשוארעכ דפנתיני , מא דאם צותי צאר צדא פי מג'אריהא , מא צרחתי ליה ? | | תח'בי נאמי פי מכאנכ , בקולוא מנכ אלליל ע'יראן | צ'לי אנת אלענואן , לאנה פי בעדכ מא אלנאש ג'יראן | | אחנא אלחכאיא אלג'דאד | אחנא אלהדאיא אלג'דאד | | אחנא אלחכאיא אלי ...מש כל שיא בירצ'יכי בירצ'ינא | אנת תע'ירתי ליה .. צ'ל שוקי אנא שלאל , ביג'רי בחואריכי | | טלי ברא שבאככ , ברבכ קולילי אחנא כיף ננאם ? | מא צ'לש אשי אלי ינהאן , עודי ו לאקינא לאנה אלטריק תוהאן | | אחנא אלחכאיא אלג'דאד | אחנא אלהדאיא אלג'דאד | | אחנא אלחכאיא אלי ...מש כל שיא בירצ'יכי בירצ'ינא | אנת תע'ירתי ליה .. צ'ל שוקי אנא שלאל , ביג'רי בחואריכי | | אחנא אלחכאיא אלג'דאד | אחנא אלהדאיא אלג'דאד | | אחנא אלחכאיא אלי ...מש כל שיא בירצ'יכי בירצ'ינא",
    "HebrewTitle": "",
    "ArabicTitle": "الفرعي - تغيّرتي",
    "TaatikTitle": "אלפרעי - תע'ירתי",
    "Link": "https://www.youtube.com/watch?v=1nJOku-FPV8"
  }
}
const arabicSongs = JSON.parse(JSON.stringify(arabicSongsJson))

const hebrewSongsJson = {
  "1": {
    "HebrewLyrics": "היינו זוג כל כך מושלם, את ואני | והיום כבר לא רואים אחד את השני | לא חבל על שנינו, את זה לא הבנתי | תני לי הזדמנות, אני עייפתי. | | מה אני עשיתי, מה כבר | העולם מחדיר בי פחד | ואני כבר לא אני | כי את כבר לא איתי. | | הייתי כה רגוע, עכשיו הלב פצוע | הראש רק בך שקוע, הוזה אותך מולי | תדעי שאת הולכת, הים סוער אין שקט | ורק דמעות זולגות, שוטפות את כל כולי. | | מה איתך ילדה, אולי ספרי לי | שתיקתך שברה הכל בתוכי | לאהוב אותך לעד נשבעתי | את הדבר הכי יקר לקחת לי",
    "ArabicLyrics": "",
    "TaatikLyrics": "",
    "HebrewTitle": "אייל גולן - הוזה אותך מולי",
    "ArabicTitle": "",
    "TaatikTitle": "",
    "Link": "https://www.youtube.com/watch?v=OqvjE5c4444"
  },
  "2": {
    "HebrewLyrics": "היי, אף פעם לא ראיתי עוד חיוך כזה | אחת כמוך בטח שומעת את זה הרבה | ואין מצב אני יוצא מפה לבד | כמעט הלכתי כבר אז כמה טוב שבאת | | אני מרגיש שאת יודעת בדיוק מה את עושה | כשאת עוברת ברחוב ואז שולחת נשיקה | כאילו לא בכוונה איך את גונבת לכולן ת'הצגה | כאילו לא בכוונה וכל העיר כבר מסביבך התעוררה | | תמיד כולם קראו לך הזהב של השכונה | אבל היום, היום תשאלי בכל המדינה | תגידו מי הכי יפה בכל העיר ? | עונים לי: היא הכי יפה שאני מכיר ! | | כל סופ\"ש את מגיעה לפה | כמו הדבש את מביאה מתוק | ואם תתני לזה לקרות | הלילה זה אני ואת והחצוצרות | | תני לי רק כמה שעות | שנדבר בלי שכל וגם בלי דאגות | עוד כוס עליי, עוד שתיים אולי, התחלנו ! | | אם את יודעת יחסינו לאן | את תלמדי אותי ובואי נעשה בלאגן | אני היהלום שלך, את הזהב שלי | את מוזמנת לקפה אבל אפשר גם בלי | | תמיד כולם קראו לך הזהב של השכונה | אבל היום, היום תשאלי בכל המדינה | תגידו מי הכי יפה בכל העיר ? | עונים לי: היא הכי יפה שאני מכיר !",
    "ArabicLyrics": "",
    "TaatikLyrics": "",
    "HebrewTitle": "סטטיק ובן אל - זהב",
    "ArabicTitle": "",
    "TaatikTitle": "",
    "Link": "https://www.youtube.com/watch?v=cRGrIn2VHTE"
  },
  "3": {
    "HebrewLyrics": "תל אביב לפני חצות הרוח לא רוצה לנשוב | והלחות לא מרפה אותי חונקת | בבית קפה בין השכונות עוד לא כיבו את האורות | על כיסא ישן לבדה יושבת | | אני לא בטוח מה לומר אם כדאי בכלל לגשת, לסגת | ורוח באה מן הים היא משליכה מבט קטן אותי היא מזמינה לשבת | | היא מזמינה הפוך לשנינו ורק מתלוננת על החום | איזה חום אולי נזוז שואלת, גרה בדירה שכורה ממש | קרוב לדרך השלום נזמין חשבון הלילה לא הולכים לישון | | בתל אביב אחרי חצות עולים בחדר מדרגות | מוציאה מפתחות פותחת דלת, שולחן קטן שתי כורסאות | שואלת מה תרצה לשתות, אני מרגיש ממש כמו דמות מסרט | שתי כוסות על השולחן והיא מוזגת ומוזגת, אותי גומרת | פותחת עוד יין לבן זורקת לי חיוך קטן לאט ללב שלי נכנסת | | היא מזמינה הפוך לשנינו ורק מתלוננת על החום | איזה חום אולי נזוז שואלת גרה בדירה שכורה ממש | קרוב לדרך השלום נזמין חשבון | | בין כל מה שקורה בינינו מדליקה מזגן בגלל החום איזה חום | אולי נלך לחדר אם אתה רוצה אתה יכול להישאר פה גם לישון | איזה לישון הלילה לא עושים חשבון",
    "ArabicLyrics": "",
    "TaatikLyrics": "",
    "HebrewTitle": "פאר טסי - דרך השלום",
    "ArabicTitle": "",
    "TaatikTitle": "",
    "Link": "https://www.youtube.com/watch?v=VD9F_7N_MbI"
  },
  "4": {
    "HebrewLyrics": "כמו דייג עקשן עם רשת עשויה חורים | בסירת עץ קטנה מיטלטלת במים סוערים | לא ויתרת לא אמרת נואש והלב שלי חזר לפעום מחדש | | כמו צדפה על חול שנשטפה אל החוף בלי ברירה | הנה בא גל גדול סוחף אותה בחזרה | כבר ויתרתי כמעט אמרתי נואש והלב שלי חזר לפעום מחדש | | איך אפשר שלא להתאהב בך | איך אפשר שלא להתאהב | איך כולם בעולם לא מאוהבים בך גם | איך אפשר שלא להתאהב | | גם כשניסיתי לסרב להיות נחושה | איך יכולתי אליך להישאר אדישה | כשהסתכלת עלי כאילו אני גלידה ואתה הכפית | וכשאמרת לי היום במיוחד את יפייפית | | איך אפשר שלא להתאהב בך | איך אפשר שלא להתאהב | רק בבקשה, כבר היה לי כואב | תשתדל לא לשבור לי את הלב",
    "ArabicLyrics": "",
    "TaatikLyrics": "",
    "HebrewTitle": "ג'יין בורדו - איך אפשר שלא להתאהב בך",
    "ArabicTitle": "",
    "TaatikTitle": "",
    "Link": "https://www.youtube.com/watch?v=-BR3ziVDazM"
  },
  "5": {
    "HebrewLyrics": "אין לנו זמן, שחור או לבן | שנה ת'גישה- היא אומרת | נצא למרדף, מקצב מטורף | רואה ת'חיים קצת אחרת | | עזוב חתונה, שמלה לבנה | חבל לה על הכסף | עם כל הכבוד ויש לה כבוד | היא רק רוצה לרקוד | | אין מה לעשות איתה | היא רק רוצה לרקוד | איפה לא תיקח אותה | היא רק רוצה לרקוד | מהחוף של מיקונוס עד החוף של מוש | עלה על הבר, אל תחשוב על מחר | היא רק רוצה לרקוד | | תיקח הלוואה, תקנה לה דירה | זה לא מעניין היא אומרת | שיגרה זה פאסה, אז אל תנסה | להיות כמו כולם, היא אחרת | | יש פעם אחת, חיים פעם אחת | זה לא חוזר עיוני | תן לה כבוד, היא פיצחה את הקוד | היא רק רוצה לרקוד | | אין מה לעשות איתה | היא רק רוצה לרקוד | איפה לא תיקח אותה | היא רק רוצה לרקוד | מהחוף של מיקונוס עד החוף של מוש | עלה על הבר, אל תחשוב על מחר | היא רק רוצה לרקוד | | וזה עושה אותה סקסית | עושה אותה יפה | עוצמת ת'עיניים | רוקדת יחפה",
    "ArabicLyrics": "",
    "TaatikLyrics": "",
    "HebrewTitle": "עומר אדם ומשה פרץ - היא רק רוצה לרקוד",
    "ArabicTitle": "",
    "TaatikTitle": "",
    "Link": "https://www.youtube.com/watch?v=h0SuqxOe1Bs"
  },
  "6": {
    "HebrewLyrics": "ואיך שלא אפנה לראות | תמיד איתה ארצה להיות | שומרת לי היא אמונים | לא מתרוצצת בגנים | וגם אני בין הבריות | לא מתפתה לאחרות | גלים עולים, חולות נעים | אוושת הרוח בעלים. | | ובלילות ובלילות | עולות עולות בי | מנגינות | וזרם דק קולח | ותפילותי לרוח | נענות. | | שקט עכשיו... | וכל אחד עסוק בענייניו | אל הרופא הכי טוב במדינה | בכדי לחשוף עד הסוף | אך התמונה לא משתנה | | מילים מילים ואת משמעותן | יבוא לו גל לשטוף אותן | אבל אני כרוך אחריה | היא מחכה לי בלילות | ללכת שבי אחריה | לשמוע את הציפורים שרות. | | גלים עולים, חולות נעים | אוושת הרוח בעלים. | | ואיך שלא אפנה לראות | תמיד איתה ארצה להיות",
    "ArabicLyrics": "",
    "TaatikLyrics": "",
    "HebrewTitle": "אריאל זילבר - ואיך שלא",
    "ArabicTitle": "",
    "TaatikTitle": "",
    "Link": "https://www.youtube.com/watch?v=T_bA-fTTo10"
  },
  "7": {
    "HebrewLyrics": "תמיד הוא בא אלי במכונית עם גג פתוח | ויולי אוגוסט מרימים לי את המצב רוח | והיפה שלי יודע את כל חולשותיי | וזה נמשך עד מתי | | תמיד אומרים לי שאני מלכה של דרמה | ויכולה גם להפנט את הדאלי לאמה | כל כך הרבה דגים בים כבר טבעתי | עכשיו | אתה תצלול עד אליי | | קוראים לי בשכונה מלכת השושנים | כל מה שבא ליד אני הופכת לקוצים | רצה כבר שמועה בשדרות של תל אביב | שלבבות אני שוברת כתחביב | | תמיד הוא בא אלי אוסף אותי עם וודג׳ של מלך | אני עושה לו פאטוצ׳ וקוברת לו בדרך | בלי המאמי תקרא לי מהיום מדמואזל | אז רק אל תתבלבל | | קוראים לי בשכונה מלכת השושנים | כל מה שבא ליד אני הופכת לקוצים | רצה כבר שמועה בשדרות של תל אביב | שלבבות אני שוברת כתחביב",
    "ArabicLyrics": "",
    "TaatikLyrics": "",
    "HebrewTitle": "עדן בן זקן - מלכת השושנים",
    "ArabicTitle": "",
    "TaatikTitle": "",
    "Link": "https://www.youtube.com/watch?v=nwpLIXdrHS0"
  }
}
const hebrewSongs = JSON.parse(JSON.stringify(hebrewSongsJson))

function getAllSongs(){
	console.log("getAllSongs Start");
	
	var hebrew = ``;
	var i;
	for (i = 0; i < Object.keys(hebrewSongs).length; i++) {
		var title = hebrewSongs[i+1].HebrewTitle
		hebrew += `<h2><a title="`+title+`" href="#" onclick="getSong(1,`+i+`);return false;">`+title+`</a></h2>`;
	}
	
	var arabic = ``;
	var i;
	for (i = 0; i < Object.keys(arabicSongs).length; i++) {
		var title = arabicSongs[i+1].ArabicTitle
		arabic += `<h2><a title="`+title+`" href="#" onclick="getSong(2,`+i+`);return false;">`+title+`</a></h2>`;
	}
	
	var start = `<div class="row text-center">
	<figure class="col-sm-6">
        <h2>שירים בעברית</h2>`;
	var middle = `</figure>
			<figure class="col-sm-6">
    	<div class="row text-center">
        <h2>שירים בערבית</h2>`;
	var end = `</figure>
	</div>`;
	var songsStr = start + hebrew + middle + arabic + end;
	document.getElementById("songs").innerHTML = songsStr;
	console.log("getAllSongs End");
}

function getSong(lang, i){
	console.log("getSong Start");
	
	var songs = {};
	if (lang === 1) {
		songs = hebrewSongs;
	} else {
		songs = arabicSongs;
	}
	
	var hebrewTitle = songs[i+1].HebrewTitle;
	var hebrewLyrics = songs[i+1].HebrewLyrics;
	var arabicTitle = songs[i+1].ArabicTitle;
	var arabicLyrics = songs[i+1].ArabicLyrics;
	var taatikTitle = songs[i+1].TaatikTitle;
	var taatikLyrics = songs[i+1].TaatikLyrics;
	var url = songs[i+1].Link;
	
	hebrewLyrics = hebrewLyrics.replace(/ \| /g, "<br>");
	hebrewLyrics = hebrewLyrics.replace(/\| /g, "<br>");
	hebrewLyrics = hebrewLyrics.replace(/ \|/g, "<br>");
	
	arabicLyrics = arabicLyrics.replace(/ \| /g, "<br>");
	arabicLyrics = arabicLyrics.replace(/\| /g, "<br>");
	arabicLyrics = arabicLyrics.replace(/ \|/g, "<br>");
	
	taatikLyrics = taatikLyrics.replace(/ \| /g, "<br>");
	taatikLyrics = taatikLyrics.replace(/\| /g, "<br>");
	taatikLyrics = taatikLyrics.replace(/ \|/g, "<br>");
	
	if (taatikLyrics !== ``) {
		console.log("true");
	} else {
		console.log("false");
	}
	
	var hebrewTitleStr = ``
	if (hebrewTitle !== ``) {
		hebrewTitleStr = `<h2 class="rtl" style="text-decoration: underline;">`+hebrewTitle+`</h2>`;
	}
	
	var arabicTitleStr = ``
	if (arabicTitle !== ``) {
		arabicTitleStr = `<h2 class="rtl" style="text-decoration: underline;">`+arabicTitle+`</h2>`;
	}
	
	var taatikTitleStr = ``
	if (taatikTitle !== ``) {
		taatikTitleStr = `<h2 class="rtl" style="text-decoration: underline;">`+taatikTitle+`</h2>`;
	}
	
	var hebrewLyricsStr = ``
	if (hebrewLyrics !== ``) {
		hebrewLyricsStr = `<h2 class="rtl">`+hebrewLyrics+`</h2>`;
	}
	
	var arabicLyricsStr = ``
	if (arabicLyrics !== ``) {
		arabicLyricsStr = `<h2 class="rtl">`+arabicLyrics+`</h2>`;
	}
	
	var taatikLyricsStr = ``
	if (taatikLyrics !== ``) {
		taatikLyricsStr = `<h2 class="rtl">`+taatikLyrics+`</h2>`;
	}
	
	var urlStr = ``
	if (url !== ``) {
		urlStr = `<h2><a href="`+url+`">שמעו את השיר - اسمعوا الاغنية</a></h2>`;
	}
	
	var songStr = ``;
	if (lang === 1) {
		songStr = hebrewTitleStr + hebrewLyricsStr + arabicTitleStr + arabicLyricsStr + taatikTitleStr + taatikLyricsStr + urlStr;
	} else {
		songStr = arabicTitleStr + arabicLyricsStr + taatikTitleStr + taatikLyricsStr + hebrewTitleStr + hebrewLyricsStr + urlStr;	
	}
	document.getElementById("my-text-box").innerHTML = ` <div class="rectangle">
	<div id="song">
		</div>
		</div>`;
	document.getElementById("song").innerHTML = songStr;
	console.log("getSong End");
}

