var past = [];
function getItem(){
    if (past.length == hebrew.length) {
        past = [];
    }
    while (true) {
        var i = Math.floor(Math.random() * hebrew.length);
        var found = false;
        for (j = 0; j < past.length; j++) {
            if (i == past[j]) {
                found = true;
                break;
            }
        }
        if (!found) {
            break
        }
    }
    past.push(i);
    document.getElementById("hebrewText").innerHTML = hebrew[i];
	document.getElementById("arabicText").innerHTML = arabic[i];
    document.getElementById("taaticText").innerHTML = taatic[i];
}

var hebrew = [
"מפלצת",
"ג׳ירפה",
"קסם",
"(ספר (במספרה",
"עוגה",
"אגדה",
"בית חולים",
"חייזר",
"להקה",
"אי",
"קפץ",
"אוצר",
"רקדנית בטן",
"כפר",
"בלונדיני",
"תחרות",
"בדיחה",
"פסטיבל",
"שיכור",
"שמלה",
"סירה",
"נולד",
"שוד",
"לוויתן",
"חצוצרה",
"עף",
"חרב",
"כעס",
"קלפים",
"מבוקש",
"מערה",
"מגדת עתידות",
"רוח רפאים",
"רופא",
"גן חיות",
"נשך"
];

var arabic = [
"غولة",
"زرافة",
"سحر",
"حلّاق",
"كعكه",
"اسطورة",
"مستشفى",
"مخلوق فدائي",
"فرقة",
"جزيرة",
"نطّ",
"كنز",
"رقّاصة شرقيّة",
"قرية",
"اشقر",
"منافسة",
"نكتة",
"مهرجان",
"سكران",
"فستان",
"قارب",
"انولد",
"سطو",
"حوت",
"بوق",
"طار",
"سيف",
"غضب",
"شدّة",
"مطلوب",
"مغارة",
"عرّافة",
"شبح",
"طبيب",
"حديقة الحيوانات",
"عضّ"
];

var taatic = [
"ר׳ולה",
"זראפה",
"סחר",
"חלאק",
"כעכה",
"אסטורה",
"מסתשפא",
"מחלוק פדאא׳י",
"פרקה",
"ג׳זירה",
"נט",
"כנז",
"רקאס׳ה שרקיה",
"קריה",
"אשקר",
"מנאפסה",
"נכתה",
"מהרג׳אן",
"סכראן",
"פסתאן",
"קארב",
"אנוולד",
"סטו",
"חות",
"בוק",
"טאר",
"סיפ",
"ר׳ד׳ב",
"שדה",
"מטלוב",
"מר׳ארה",
"עראפה",
"שבח",
"טביב",
"חדיקת אלחיוואנאת",
"עד׳"
];

